{"title":"Tooling Equipment Technician - URGENT","description":"Responsibilities: Perform calibration and testing of equipment. Calibrate and adjust measurement instruments to ensure accuracy and reliability. Perform troubleshooting and repairs of equipment as needed. Ensure compliance with the procedures and standards. Collaborate with cross-functional teams to address equipment issues and provide technical support. Assist in the development and improvement of procedures and processes. Requirements Nitec or Higher Nitec in related field. Minimum 2 years of…","category.label":"Energy, Oil & Gas Jobs","category.tag":"energy-oil-gas-jobs","salary_min":42000.0,"contract_type":null,"skills":["develop calibration procedures","calibrate electronic instruments","ensure gambling operational standards","perform minor repairs to equipment","ensure ongoing compliance with regulations","liaise with engineers","prevent technical problems with stage equipment","provide technical documentation","assist in the development of standard operating procedures in the food chain","Sardinian","calculate dividends"]}
{"title":"Technical Sales Engineer (Spraying\/Fluid Control System)","description":"Responsibilities: Identify and develop new business opportunities within the spraying\/fluid control industry. Build and maintain strong relationships with existing clients to ensure customer satisfaction and repeat business. Deliver technical presentations and demonstrations to potential clients to showcase the features and benefits of the company's spraying and fluid control solutions. Understand customer requirements and provide technical solutions tailored to their needs. Prepare sales propo…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":36000.0,"contract_type":null,"skills":["identify new business opportunities","balance hydraulics of hot water systems","maintain relationship with customers","guarantee customer satisfaction","provide technical expertise","identify customer requirements","provide technical expertise","collect briefing regarding products"]}
{"title":"Project Manager - Senior level (Large Scale Projects, PMP, Engineering)","description":"Responsibilities: Lead and manage large-scale projects from initiation to completion. Develop and maintain project plans, including cost estimates, budgets, schedules, and resource allocation. Coordinate with stakeholders to ensure project objectives are met. Monitor project progress and identify and address any issues or risks that may arise. Manage project scope, timeline, and budget. Ensure compliance with regulatory requirements and industry standards. Communicate and collaborate with clien…","category.label":"Energy, Oil & Gas Jobs","category.tag":"energy-oil-gas-jobs","salary_min":90000.0,"contract_type":null,"skills":["manage packaging development cycle from concept to launch","develop project schedule","cost management","communicate with stakeholders","finish project within budget","document project progress","deal with unforeseen incidents in hospitality","develop project schedule","ensure compliance with legal requirements","be empathic to production team"]}
{"title":"Compliance Analyst (Data, Business, FMCG)","description":"Responsibilities: Conduct compliance audits and assessments to ensure adherence to company policies and regulatory requirements. Analyze business processes and data to identify compliance risks and develop recommendations for improvement. Develop and implement compliance monitoring and reporting systems. Collaborate with cross-functional teams to design and implement compliance training programs. Assist in the development and maintenance of compliance policies and procedures. Stay updated on ch…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":42000.0,"contract_type":null,"skills":["perform contract compliance audits","ensure compliance with company regulations","analyse business processes","address identified risks","identify improvement actions","support implementation of quality management systems","monitor pumping system operations","coordinate engineering teams","monitor curriculum implementation","ensure compliance with accounting conventions"]}
{"title":"Project Coordinator (Machinery\/West)","description":"Responsibilities: Coordinate and execute mechanical service projects to ensure timely completion and customer satisfaction. Collaborate with internal teams and external vendors to gather project requirements and specifications. Develop project plans and schedules, and monitor progress. Manage project budgeting and cost control. Ensure compliance with safety regulations and industry standards. Provide technical support and troubleshooting for project-related issues. Prepare project documentation…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":36000.0,"contract_type":null,"skills":["coordinate construction activities","guarantee customer satisfaction","liaise with engineers","create project specifications","develop project schedule","monitor therapeutic progress","manage operational budgets","manage budgets","cost management","ensure compliance with safety legislation","provide technical expertise","prevent technical problems with stage equipment","draft project documentation"]}
{"title":"Branding and Partnership, Senior Manager","description":"ECB Financial Group is an award-winning financial institution dedicated to providing innovative and reliable trading and financial solutions while fostering sustainability and social responsibility. We are committed to enhancing our brand presence and promoting sustainable practices across all aspects of our operations. We are seeking a dynamic and experienced Branding and Partnership Senior Manager \/ Team Lead to lead our efforts in brand development, strategic partnerships, and amplification …","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":9000.0,"contract_type":null,"skills":["plan"]}
{"title":"Payroll Assistant (MNC, Manufacturing)","description":"Responsibilities: Assist in the end-to-end payroll process for employees. Ensure accurate and timely processing of employee timesheets, allowances, and deductions. Calculate and process monthly payroll. Prepare payroll reports for management review. Handle payroll queries from employees and resolve any discrepancies. Maintain accurate payroll records and documentation. Coordinate with relevant departments to obtain necessary payroll information. Stay updated on payroll regulations and complianc…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":30000.0,"contract_type":null,"skills":["carry out end of day accounts","ensure accurate engravings","manage payroll reports","prepare financial auditing reports","manage payroll reports","advise on machinery malfunctions","maintain financial records","coordinate operational activities","obtain financial information","keep up-to-date to current customs regulations"]}
{"title":"Sales Support Executive (Automotive Parts\/ SAP system)","description":"Responsibilities: Provide sales support and coordination for the automotive sales team. Assist with order processing, tracking, and fulfillment. Coordinate with internal teams to ensure timely delivery of products to customers. Prepare sales quotations and proposals. Handle customer inquiries and provide product information. Monitor and maintain accurate sales records and customer databases. Track sales activities, forecasts, and targets. Assist in identifying new business opportunities and dev…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":30000.0,"contract_type":null,"skills":["supervise sales activities","dispatch order processing","liaise with engineers","oversee delivery of fuel","issue sales quotations for repairs or maintenance","monitor customer inquiries","provide financial product information","maintain customer records","forecast account metrics","deliver correspondence","identify new business opportunities"]}
{"title":"Sales Manager (Construction, Engineering) - North","description":"Responsibilities: Develop and implement sales strategies to achieve revenue targets for facility, construction, and engineering solutions. Identify and develop new business opportunities, including expanding the company's client base and market reach. Build and maintain strong relationships with key clients and partners. Lead and manage a team of sales representatives to drive sales performance. Oversee the entire sales process, from lead generation to closing deals. Collaborate with internal t…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":48000.0,"contract_type":null,"skills":["collaborate in the development of marketing strategies","achieve sales targets","identify new business opportunities","identify market niches","build business relationships","manage sales teams","achieve sales targets","execute after sales activities","Welsh"]}
{"title":"Site Supervisor\/ Project Supervisor (Engineering\/ACMV\/M&E)","description":"Responsibilities: Supervise and oversee M&E (Mechanical and Electrical) works on construction sites. Coordinate and collaborate with project teams, subcontractors, and suppliers. Monitor and manage the progress of M&E works according to project plans. Ensure compliance with safety regulations and procedures. Review and approve design drawings and specifications related to M&E works. Resolve any issues or challenges that may arise during construction. Conduct regular site inspections to ensure q…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":42000.0,"contract_type":null,"skills":["inspect construction sites","liaise with engineers","energy","ensure compliance with construction project deadline","ensure compliance with safety legislation","draft design specifications","MOEM","deal with unforeseen incidents in hospitality","undertake inspections","watch scenes"]}
{"title":"Hiring Manager","description":"Betterpay talent solutions is a global recruiting company, we currently support our client to find a good candidate for senior legal manager in USA. This company is a prominent mobile game development company recognized for creating captivating mobile games. With a track record of launching three well-known products that have attracted over 20 million players worldwide, they have established a strong global presence. The offices are located in Singapore and Beijing, and we have recently opened …","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":120000.0,"contract_type":null,"skills":[]}
{"title":"Business Partner - Senior level (HR, Logistics Industry)","description":"Responsibilities: Collaborate with business leaders to understand their objectives and provide strategic HR guidance and support. Partner with key stakeholders to develop and implement HR initiatives that drive business performance and facilitate organizational growth. Lead talent acquisition efforts, including workforce planning, recruitment, selection, and onboarding. Manage employee relations matters and provide guidance on complex HR issues. Design and implement performance management syste…","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":66000.0,"contract_type":null,"skills":["liaise with managers","provide anger management counselling","engage with stakeholders","develop organisational policies","implement operational business plans","manage profitability","human resources department processes","lead the brand strategic planning process","negotiate with social service stakeholders","advise on conflict management","implement traceability systems"]}
{"title":"Accountant","description":"Activate Interactive Pte Ltd (“Activate”) is a leading technology consultancy headquartered in Singapore with a presence in Malaysia and Indonesia. Our clients are empowered with quality, cost-effective, and impactful end-to-end application development, like mobile and web applications, and cloud technology that remove technology roadblocks and increase their business efficiency. We believe in positively impacting the lives of people around us and the environment we live in through the use of t…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":5200.0,"contract_type":null,"skills":[]}
{"title":"Retail Sport Specialist (Bedok) - Part time - SGD11.5 per hour","description":"Decathlon is your sports wonderland We are the champs in crafting and slinging sporting goods, apparel, and equipment. Whether you're smashing goals or conquering the great outdoors, Decathlon's got your back – because winning is our favorite sport At Decathlon, we're not just a workplace – we're a lifestyle, and we want you to experience the very best. Join us and let's conquer the world of sports together  What is our culture like ? Where decisions spark High-fives : Decathlon rocks a lively,…","category.label":"Part time Jobs","category.tag":"part-time-jobs","salary_min":11.0,"contract_type":null,"skills":["manage fitness goals","animate in the outdoors"]}
{"title":"Private Equity and Investment Associate - APAC","description":"About Us Our client is a premier financial services firm specializing in investment banking, wealth management, and financial advisory services. Renowned for delivering exceptional results through innovative solutions and dedicated expertise, their cutting-edge AI accelerates research and due diligence for Private Equity (PE), Venture Capital (VC), and Banking sectors. Job Description Position Summary: Our client seeks a motivated and detail-oriented Investment Banking Associate to drive produc…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":80000.0,"contract_type":null,"skills":["Serbian","service-oriented modelling"]}
{"title":"HR Manager","description":"Responsibilities: Develop and implement HR strategies, policies, and programs that align with the company's goals and objectives. Manage the end-to-end HR process, including recruitment, onboarding, performance management, compensation and benefits, employee relations, and legal compliance. Ensure the company's HR practices are in compliance with relevant labor laws and regulations. Provide guidance and support to managers and employees on HR-related matters. Manage the payroll process and ensu…","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":60000.0,"contract_type":null,"skills":["develop employee retention programs","human resources department processes","Process-based management","ensure implementation of safe driving practices","accept criticism and guidance","human resources department processes","manage payroll"]}
{"title":"QA Technician (Welding Inspector\/Metal\/Machining\/East)","description":"Responsibilities: Perform inspections and quality checks on welded metal components and machined parts. Conduct visual inspections and non-destructive testing (NDT) of welds. Ensure compliance with welding specifications and industry standards. Collaborate with cross-functional teams to address quality issues and implement corrective actions. Maintain inspection records and documentation. Monitor and maintain equipment used for inspections. Conduct internal audits to evaluate the effectiveness …","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":27600.0,"contract_type":null,"skills":["perform quality audits","design metal components","use non-destructive testing equipment","types of moulded fibres","N1QL","weld underwater","ensure conformance to jewel design specifications","welding techniques","coordinate engineering teams","report chimney defects","manage corrective actions","inspect aircraft documentation","manage inspections of equipment","perform quality audits"]}
{"title":"Tender Quantity Surveyor\/Senior (Interior Design\/Construction)","description":"Responsibilities: Prepare and submit tender proposals, including cost estimates, bill of quantities, and pricing schedules. Review and analyze project specifications and drawings to accurately determine project requirements. Collaborate with project teams to develop accurate and competitive tender submissions. Liaise with clients, consultants, and subcontractors to gather necessary information for tender preparation. Compile and submit quotations for projects, including all necessary materials …","category.label":"Trade & Construction Jobs","category.tag":"trade-construction-jobs","salary_min":60000.0,"contract_type":null,"skills":["draft tender documentation","plan","evaluate budgets","create project specifications","define technical requirements","draft tender documentation","liaise with specialist contractors for well operations","draft tender documentation","compile appraisal reports"]}
{"title":"Hvac \/CRAC\/Assistant Field Service Engineer(Data Center)","description":"Hvac \/CRAC\/Assistant Field Service Engineer(Data Center) Up to S$4.5K Permanent, 9am to 6pm,5.5days, Paya Lebar Product: Heating, ventilation, air conditioning (Hvac)solution for data center Our client MNC in air conditioning and humidification system solution serving high tech industry Years in business : > 50 yrs worldwide Area of business : Global Carry out Hands on service, maintenance, commissioning, troubleshooting, repair of data center Aircon\/Hvac\/ CRAC (computer room aircon ) Documenta…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":0.0,"contract_type":"permanent","skills":["carry out auditions"]}
{"title":"Senior, Project Engineer (Machinery\/Processing System)","description":"Responsibilities: Manage and oversee machinery projects for powder processing. Coordinate with clients, suppliers, and internal teams to ensure successful project execution. Review and analyze project requirements and specifications. Provide technical expertise and support in the selection and procurement of machinery and equipment. Prepare project schedules, budgets, and resource allocation plans. Monitor project progress and ensure adherence to timelines and deliverables. Conduct site visits …","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":45600.0,"contract_type":null,"skills":["coordinate construction activities","liaise with engineers","ensure sentence execution","ensure conformance to jewel design specifications","provide technical expertise","support witnesses","plan procurement of meteorological equipment","prepare timelines for pipeline development projects","document project progress","ensure adherence to the constitution","perform playground surveillance"]}
{"title":"Sales Executive - Senior role (Business, Commodities, Precious Metals)","description":"Responsibilities: Develop and implement business and sales strategies to drive revenue growth in the precious metals industry and adjacent industries. Identify and develop new business opportunities, including expanding the company's client base and market reach. Build and maintain strong relationships with key clients and partners. Lead and motivate a team of sales representatives to achieve sales targets and objectives. Analyze market trends, customer needs, and competitor activities to ident…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":18000.0,"contract_type":null,"skills":["develop revenue generation strategies","manage revenue","identify new business opportunities","identify market niches","build business relationships","motivate staff to reach sales targets","analyse consumer buying trends"]}
{"title":"Head of Operations\/ General Manager (3PL, Warehousing\/ Distribution Business)","description":"Responsibilities: Oversee and manage all operational aspects of the 3PL (Third-Party Logistics) warehousing and distribution business. Develop and implement strategies to optimize operational efficiency, quality, and customer satisfaction. Lead and manage a team of operations staff, including warehouse supervisors, logistics coordinators, and drivers. Ensure efficient and accurate receiving, storing, and shipping of goods. Monitor and analyze key performance indicators (KPIs) to identify areas …","category.label":"Logistics & Warehouse Jobs","category.tag":"logistics-warehouse-jobs","salary_min":102000.0,"contract_type":null,"skills":["manage lottery operations","coordinate technological activities","guarantee customer satisfaction","manage a team","oversee logistics of finished products","track key performance indicators"]}
{"title":"Admin - Corporate Secretary Intern","description":"About Sleek Sleek is on a mission to revolutionize how entrepreneurs operate their business. We want to give small and medium business owners, entrepreneurs and investors, peace of mind and the power of online solutions to allow them to focus on what they do best - growing their business. As we work for our thousands of customers, we offer a fully digital experience to all our clients, and all their transactions, requests and documents signing are made online. In addition, we gather millions of…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":800.0,"contract_type":"contract","skills":[]}
{"title":"Site Utility Supervisor - Listed MAINCON","description":"Responsibilities: Responsible for the overall planning, design, and installation of utility systems and equipment for construction projects. Ensure compliance with regulatory standards and code requirements. Coordinate with project teams and subcontractors to ensure efficient and effective utility system installations. Review and approve utility system designs, drawings, and specifications. Oversee the testing, commissioning, and maintenance of utility systems. Monitor and manage utility system…","category.label":"Energy, Oil & Gas Jobs","category.tag":"energy-oil-gas-jobs","salary_min":33600.0,"contract_type":null,"skills":["plan","shape ornamental design","install utility equipment","ensure compliance with legal requirements","coordinate construction activities","ensure proper water storage","ensure conformance to jewel design specifications","manage inspections of equipment","monitor utility equipment"]}
{"title":"Technical Manager\/ Associate (UPS\/DC, Electronics)","description":"Responsibilities: Manage and oversee the technical aspects of projects. Lead and supervise a team of technicians and engineers in the installation, maintenance, and troubleshooting. Collaborate with clients to understand their power backup requirements and provide customized solutions. Conduct site surveys and assessments. Design and develop architectures and infrastructure. Ensure compliance with industry standards and regulations in the implementation of power backup systems. Provide technica…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":42000.0,"contract_type":null,"skills":["manage technical aspects of vineyard production","supervise dental technician staff","troubleshoot","liaise with engineers","provide customised products","conduct engineering site audits","define software architecture","ensure compliance with company regulations","brainstorm ideas"]}
{"title":"Restaurant Manager (F&B)","description":"Responsibilities: Oversee the overall operations of the restaurant, ensuring efficient and smooth daily functioning. Manage and train the restaurant staff, ensuring high standards of customer service and satisfaction. Develop and implement strategies to drive sales and increase revenue. Monitor and control operational costs, including food and beverage inventory management. Ensure compliance with health and safety regulations and maintain cleanliness and hygiene standards. Maintain excellent re…","category.label":"Hospitality & Catering Jobs","category.tag":"hospitality-catering-jobs","salary_min":30000.0,"contract_type":null,"skills":["ensure cleanliness of food preparation area","ensure smooth on board operations","manage zoo staff","provide high quality customer service","coordinate technological activities","achieve sales targets","manage revenue","monitor painting operations","ensure compliance with safety legislation","maintain personal hygiene standards when cleaning"]}
{"title":"Freelance Book Publicist","description":"Hello We are seeking talented publicists to join our fast-growing community of top talent in the publishing industry. Reedsy's vetted group of freelancers have worked with bestselling authors like Stephen King, Suzane Collins (The Hunger Games) E.L. James (Fifty Shades of Grey), or Originals (Adam Grant). Requirements - Have 3 years of experience. - Demonstrate experience on at least 5 published books. Benefits As a Reedsy publicist, you can pick which genres you'd like to receive requests for …","category.label":"Creative & Design Jobs","category.tag":"creative-design-jobs","salary_min":38000.0,"contract_type":"contract","skills":[]}
{"title":"Logistics Assistant","description":"Perform daily warehouse duties including but not limited to inbound (unstuffing of containers, receiving, sorting, checking, Put-away to location), outbound (labelling, picking, packing, release of cargo) to ensure on-time receiving and accurate delivery of goods according to SOP. Perform Cycle Count and stock-taking accurately SAP WMS transactions in relation to warehouse duties Optimizing warehouse space and ensure bin accuracy. Good housekeeping (5S) and safety practice to achieve well-organ…","category.label":"Logistics & Warehouse Jobs","category.tag":"logistics-warehouse-jobs","salary_min":1900.0,"contract_type":null,"skills":["perform office routine activities","dispose of soldering waste","consultation","archaeology","tennis","Islam","adapt artistic plan to location","livestock","wildlife","types of cargo","prepare shipments in time","perform fuel reconciliation","optimise production","ensure envelope quality","SAP R3"]}
{"title":"Operational Transformation Lead","description":"Will work with Ops team to review Target Operating Model for new platform implementation. Test and sign off any requirements for new model. Develop and lead the strategic transformation roadmap for operations within the Transfer Agency and Funds Post Trade\/Order Management domain. Lead and manage change initiatives, ensuring seamless transitions in operations. Implement robust risk management strategies to mitigate operational risks. Ensure compliance with regulatory requirements and industry s…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":60000.0,"contract_type":null,"skills":["collaborate with coaching team","define integration strategy","perform quality control of design during a run","lead the brand strategic planning process","transfer medication","rescue bathers","energy","dispatch order processing","apply change management","ensure smooth on board operations","implement risk management for outdoors","plan railway incident mitigation measures","ensure ongoing compliance with regulations"]}
{"title":"Trackwork Quality Engineer Careers Worknow","description":"Responsibilities: Plan inspection programs and adhere to quality control requirements. Conduct audits and inspections to ensure compliance with ISO quality management system requirements. Collaborate with cross-functional teams to resolve quality issues and implement corrective actions. Perform daily track inspections with clients and the construction team. Develop and deliver training programs on ISO quality management system. Review materials for any physical damage and ensure there is proper…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":48000.0,"contract_type":null,"skills":["execute inspection walkway","adhere to standard procedures","perform quality audits","ensure compliance with safety legislation","coordinate engineering teams","handle incidents","manage corrective actions","execute inspection walkway","develop training programmes","implement quality management systems","report defective manufacturing materials"]}
{"title":"Laboratory Calibration Assistant - URGENT","description":"Responsibilities: Assist in the setup and maintenance of laboratory equipment. Perform basic testing and calibration of laboratory instruments. Prepare and organize samples for analysis. Ensure cleanliness and tidiness of the laboratory. Assist in maintaining inventory and ordering laboratory supplies. Follow safety protocols and adhere to quality control standards. Support laboratory staff in various tasks as required. Requirements Nitec or Diploma in a related field. Prior experience in a lab…","category.label":"Scientific & QA Jobs","category.tag":"scientific-qa-jobs","salary_min":25000.0,"contract_type":null,"skills":["Ensure correct use of bakery equipment","calibrate laboratory equipment","write calibration report","collect samples for analysis","Ensure correct use of bakery equipment","maintain inventory of office supplies","follow airport safety procedures","adhere to standard procedures","assist in the production of laboratory documentation","Sardinian","sex education"]}
{"title":"Business Development\/ Sales Engineer (Testing & Certifying Solution)","description":"Responsibilities: Identify and develop new business opportunities within the medical solutions industry in the West region. Build and maintain strong relationships with existing clients to ensure customer satisfaction and repeat business. Deliver technical presentations and demonstrations to potential clients to showcase the features and benefits of the company's medical solutions. Understand customer requirements and provide tailored solutions to meet their needs. Prepare sales proposals and n…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":30000.0,"contract_type":null,"skills":["identify new business opportunities","medical devices","maintain relationship with customers","guarantee customer satisfaction","provide technical expertise","train staff about product features","identify with the company's goals","identify customer requirements","provide customised products","draw up marketing and sales plan"]}
{"title":"Senior, HR & Admin Executive (Real Estate Industry)","description":"Responsibilities: Manage end-to-end HR processes, including recruitment, onboarding, employee relations, performance management, and offboarding. Work closely with hiring managers to identify staffing needs and conduct effective recruitment strategies. Coordinate and conduct interviews, assessments, and reference checks. Facilitate new hire onboarding and orientation processes. Handle employee relations matters, including grievance handling, disciplinary actions, and performance improvement pla…","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":32400.0,"contract_type":null,"skills":["Process-based management","work closely with news teams","monitor staff absences","manage advocacy strategies","coordinate pre-show checks","monitor concrete curing process","manage employee complaints","consultation","coaching techniques"]}
{"title":"Senior, Sales Engineer (Mechanical\/O&G) - MNC","description":"Responsibilities: Identify and develop new business opportunities. Build and maintain strong relationships with existing clients to ensure customer satisfaction and repeat business. Deliver technical presentations and demonstrations to potential clients. Understand customer requirements and provide technical solutions tailored to their needs. Prepare sales proposals and negotiate contracts with clients. Collaborate with internal teams to ensure timely and accurate delivery of products and servi…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":42000.0,"contract_type":null,"skills":["identify new business opportunities","maintain relationship with customers","guarantee customer satisfaction","provide technical expertise","identify customer requirements","provide technical expertise","produce sales reports","negotiate sales contracts","liaise with engineers","set up props in a timely manner"]}
{"title":"Service Delivery Manager (Security Vulnerabilities and Remediations Management)","description":"The Service Delivery Manager is responsible for overseeing the end-to-end management of security vulnerability remediation processes. This role requires a deep understanding of security best practices, risk management, and IT service delivery. The successful candidate will collaborate with cross-functional teams to identify, prioritise, and mitigate security vulnerabilities by rolling out patches and fixes, ensuring the protection of organisational assets. Responsibilities: Vulnerability Manage…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":6000.0,"contract_type":"contract","skills":["plan railway incident mitigation measures","coordinate security","develop site remediation strategies","system backup best practice","risk management","ICT project management","boxing","coordinate engineering teams","Shiva","analyse potential threats against national security","fix minor scratches","apply system organisational policies"]}
{"title":"Sales Representative","description":"If you believe in delighting customers, have high standards and are resourceful, we want to hear from you. You will: Support and develop the growth strategy for the team and manage day-to-day sales operations. Be accountable for increasing revenue, new client acquisition and\/or existing account growth. Assist in developing an effective sales training program. Effectively work cross-functionally to shape the product roadmap based on data-driven insights. Assist in refining the company’s sales st…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":40000.0,"contract_type":null,"skills":["satisfy customers","electricity","listen actively","collaborate in the development of marketing strategies","carry out end of day accounts","manage revenue","identify new business opportunities","deliver correspondence","develop outreach training plans","think proactively to secure sales","define technology strategy","gather data","business intelligence","collaborate in company's daily operations"]}
{"title":"Senior Solidity Smart Contract Engineer - Expression of Interest","description":"About prePO  prePO is a decentralized asset provider offering onchain exposure to pre-IPO companies. Our mission is to democratize pre-IPO investing—transforming a world of financial exclusion into a world of permissionless access. The Dream Team  At prePO, we are building a fully-remote, globally-distributed dream team. Like a professional sports team, we want every player on the field to be a superstar in their position and play extremely effectively with others. We are also backed by world-c…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":120000.0,"contract_type":null,"skills":[]}
{"title":"Generative AI Trainer - Adjunct Faculty","description":"Job Objective We are seeking an experienced and knowledgeable Chatbot Development Trainer to lead our training program. The ideal candidate will have extensive expertise in chatbot design, development, and deployment, with a strong understanding of AI generative models and practical experience using platforms like Microsoft Copilot Studio. This role involves delivering comprehensive training sessions, providing one-on-one mentoring, and guiding learners through hands-on projects to build robust…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":1080.0,"contract_type":"contract","skills":["assertiveness","Rapid application development","Jenkins","build predictive models","OpenEdge Database","provide arts coaching sessions","provide mentorship","use traditional toolbox tools"]}
{"title":"System Admin Engineer -ST-TNC240415 002\/05","description":"The Company: A port operator is expanding the team and is looking for System Admin Engineers . The Role: You will be responsible for the following as a System Admin Engineer : Configure and maintain the networked computer system, including hardware, system software, and applications. Ensure data is stored securely and backed up regularly. Diagnose and resolve hardware, software, networking, and system issues when they arise. Install and configure software, hardware and networks. Monitor system …","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":4500.0,"contract_type":"contract","skills":["configure ICT system","industrial software","handle saw securely","prevent damage to electrical devices on board","configure electronic equipment"]}
{"title":"Project Coordinator (Mechanical\/West)","description":"Responsibilities: Reply to customer queries & aid in drafting sales proposals. Process orders accurately and promptly. Manage delivery arrangements with clients. Help create promotional materials for events and conferences. Manage project activities, resources, equipment, and information. Track project advancement and address any arising issues. Compile and update detailed project documentation, plans, and reports. Requirements Diploma in Mechanical Engineering or related field. Familiarity wit…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":50000.0,"contract_type":null,"skills":["monitor customer inquiries","negotiate sales contracts","process customer orders","monitor after sales records","design press kit for media","manage operational budgets","evaluate mine development projects","advise on poisoning incidents","draft project documentation","mechanical engineering"]}
{"title":"Retail Management Intern","description":"We are currently recruiting dedicated Retail Management Interns to join our retail team. Among the responsibilities are attracting customers and generate profits, assisting with product releases and events, improving product knowledge, answering questions, and addressing customer concerns. In a fast-paced environment, you should be able to multitask and provide excellent customer service. To be a great Retail Management Intern, you must be extremely passionate about the products and can inspire…","category.label":"Retail Jobs","category.tag":"retail-jobs","salary_min":12000.0,"contract_type":"contract","skills":["tattoo customers","manage yield","assist with book events","manage rubber products development","answer incoming calls","monitor customer inquiries","establish daily priorities","provide fitness customer service","manage discarded products"]}
{"title":"Sales Executive (Packaging) - West","description":"Responsibilities: Develop and implement sales strategies to target clients in the packaging or kitchen equipment industry. Identify and prospect new business opportunities and generate leads. Build and maintain relationships with key clients. Understand clients' needs and provide customized solutions. Present and demonstrate products to clients. Negotiate and close sales deals. Monitor sales performance and provide regular reports to management. Stay updated on industry trends and competitor ac…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":30000.0,"contract_type":null,"skills":["collaborate in the development of marketing strategies","screen clients","identify new business opportunities","prospect new customers","build business relationships","identify clients' needs","provide customised products","communicate technicalities with clients","negotiate sales contracts","study sales levels of products","write routine reports","stay alert"]}
{"title":"IT Admin","description":"Responsibilities: Maintain service items inventory control and order parts Preparation and coordination IT Engineers schedules for on-site\/ outsource\/ inhouse projects & backfill purposes on daily basis Liaising with Sales Dept & IT Dept closely on after-sales matters Handle incoming calls and enquires from corporate customers Answer email correspondence in a prompt and efficient manner Maintain proper records for billing purpose Maintain neat and timely update on the service form inputs to our…","category.label":"Customer Services Jobs","category.tag":"customer-services-jobs","salary_min":26400.0,"contract_type":"permanent","skills":["manage inventory of camping supplies","provide customer follow-up services"]}
{"title":"Security Engineer -CT-FNC240612 003\/01","description":"We are seeking a highly skilled Security Engineer with extensive experience in managing, configuring, and upgrading a wide range of security technologies. The ideal candidate will possess strong technical expertise and excellent communication skills. This role requires a proactive individual who can effectively manage security incidents and ensure adherence to security policies and best practices. Responsibilities: · Manage, configure, and upgrade a diverse range of security technologies. · Res…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":5000.0,"contract_type":"contract","skills":["surgery","configure media integration systems","apply technical communication skills","provide technical expertise","prompt performers","manage technical security systems","ensure implementation of safe driving practices","plan pilotage","prevent technical problems with media integration systems"]}
{"title":"Intern - Software Engineering Intern","description":"Activate Interactive Pte Ltd (“Activate”) is a leading technology consultancy headquartered in Singapore with a presence in Malaysia and Indonesia.Our clients are empowered with quality, cost-effective, and impactful end-to-end application development, like mobile and web applications, and cloud technology that remove technology roadblocks and increase their business efficiency. We believe in positively impacting the lives of people around us and the environment we live in through the use of te…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":1000.0,"contract_type":"contract","skills":[]}
{"title":"Financial Operations Analyst (Global Payments)","description":"About Sleek Sleek is on a mission to revolutionize how entrepreneurs operate their business. We want to give small business owners peace of mind and the power of online solutions to allow them to focus on what they do best - growing their business. As we work for our thousands of customers, we gather millions of data points about their business, and in turn we transform those into useful, actionable insights and recommendations to accelerate their growth through smart algorithms. We are a team …","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":3500.0,"contract_type":null,"skills":[]}
{"title":"Senior, Technical Sales Engineer (Powder Processing\/North)","description":"Responsibilities: Identify and develop new business opportunities within the machinery\/powder processing industry in the North region. Build and maintain strong relationships with existing clients to ensure customer satisfaction and repeat business. Deliver technical presentations and demonstrations to potential clients to showcase the features and benefits of the company's machinery and powder processing solutions. Understand customer requirements and provide technical solutions tailored to th…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":45600.0,"contract_type":null,"skills":["identify new business opportunities","handle metal powder","maintain relationship with customers","guarantee customer satisfaction","provide technical expertise","assess customers","provide technical expertise"]}
{"title":"Commissioning Engineer (Hvac)(Data Center)","description":"Hvac Data Center Commissioning Engineer Permanent, 5.5 days, Tai Seng (KA centre) Our client MNC HVAC equipment company for data center Job Scope · To Conduct assessments of hvac designs to ensure that they meet the required specifications and standards within allotted timeline. · To verify and prove that hvac systems in data centre build and function according to the requirement. · To execute, lead n manages the commissioning process across all projects, from start-up, designing, construction,…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":66000.0,"contract_type":"permanent","skills":["perform oil clarification with boiling methods","operate file for deburring","maintain the trails","Croatian","manage technical aspects of vineyard production","apply permanent make-up"]}
{"title":"Assistant\/ Contracts Manager (Construction Industry)","description":"Responsibilities: Manage the entire contracts lifecycle, including contract drafting, negotiation, and administration. Ensure compliance with contractual terms and conditions. Monitor contract performance and take necessary actions to address any issues. Collaborate with internal stakeholders to develop and implement contract management strategies. Review and analyze contract terms and conditions to identify potential risks and propose mitigation measures. Provide guidance and support to projec…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":66000.0,"contract_type":"contract","skills":["procurement lifecycle","contract law","maintain contractual information","perform contract reporting and evaluation","intervene with actions on stage","advise on poisoning incidents","communicate with stakeholders","develop procurement strategy","perform contract reporting and evaluation","address identified risks","plan railway incident mitigation measures","accept criticism and guidance"]}
{"title":"Retail Associate - Midnight","description":"Responsible for the day-to-day retail operations & sales achievement of given target Communicate to customers about on-going promotions & offers Promote first class service excellence & customer experience at all times Adhere to duty roster & assignments given by the Supervisors\/Managers Be the company’s front line ambassador to uphold company’s branding and image Requirements NITEC \/ GCE O Level and above Strong customer service skills Good written and oral command of English Service-oriented …","category.label":"Customer Services Jobs","category.tag":"customer-services-jobs","salary_min":1800.0,"contract_type":null,"skills":["provide customer follow-up services","make the beds","provide first aid","customer service","customer service","ethics","warehouse operations","apply HACCP","English"]}
{"title":"Design Engineer (AutoCAD Software\/Revit) URGENT","description":"Responsibilities: Create detailed design drawings using AutoCAD Software and Revit. Collaborate with architects and other engineering disciplines to develop and modify design concepts. Review and analyze design specifications and requirements. Prepare accurate and comprehensive design documentation. Coordinate with project teams to ensure timely completion of design deliverables. Conduct quality checks on design drawings to ensure compliance with standards and codes. Stay updated with the lates…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":48000.0,"contract_type":null,"skills":["draft design specifications","create AutoCAD drawings","Metasploit","liaise with architects","develop design concept","verify product specifications","draft project documentation","liaise with engineers","finish project within budget","ensure conformance to jewel design specifications","ensure compliance with company regulations"]}
{"title":"Software Developer - CT-FNP231003 001\/02","description":"As a vital member of the team, you will play a pivotal role in shaping the digital landscape. Your responsibilities will include: Innovative Development: Contribute to the creation of new features and actively participate in the enhancement of our internal tools, including configuration management, service frameworks, and monitoring and continuous deployment systems. Architectural Design: Design new components within a sophisticated distributed architecture, leveraging microservices principles …","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":7000.0,"contract_type":null,"skills":["oversee development of software","assist in the development of standard operating procedures in the food chain","think innovately","project configuration management","software frameworks","monitor satellites","test pipeline infrastructure operations","understand the architecture of a live performance","decentralized application frameworks"]}
{"title":"Customer Service Executive (0196 Aug 2024)","description":"Royal Ocean Marine is seeking a highly motivated and customer-focused Customer Service Executive to join our client team a logistics company in the West. As a Customer Service Executive, you will be responsible for providing exceptional service to our valued customers in the logistics industry. Job Type: Full-time Pay: $2,800.00 - $3,100.00 per month Benefits: Free parking Schedule: Monday to Friday (8.30am to 5.30pm) Company transport to\/from Jurong East MRT Monday to Friday, Key Responsibilit…","category.label":"Logistics & Warehouse Jobs","category.tag":"logistics-warehouse-jobs","salary_min":2500.0,"contract_type":null,"skills":["Serbian","customer insight","deliver outstanding service"]}
{"title":"Legal Assistant\/ Paralegal (Urgent Hiring)","description":"Responsibilities: Provide administrative support to the legal team within a multinational company (MNC). Assist in drafting and reviewing legal documents, such as contracts, agreements, and correspondence. Summarize and analyze legal documents and research for the legal team. Organize and maintain legal files, records, and documents. Assist in coordinating and scheduling meetings and appointments for the legal team. Manage and maintain legal databases and tracking systems. Assist in the prepara…","category.label":"Legal Jobs","category.tag":"legal-jobs","salary_min":36000.0,"contract_type":null,"skills":["carry out event management","revise legal documents","manage data for legal matters","compile legal documents","deliver correspondence","manage schedule of tasks","operate warehouse record systems","manage cadastre"]}
{"title":"Software Engineer (i2i Traineeship Program for OutSystems)","description":"About Us Established in 1995 in the dynamic city of Singapore, Xcellink embodies the characteristics of our home nation: process-oriented, productivity-focused, and performance-driven. As a professional services firm, we pride ourselves on our integrity, teamwork, resilience, and strong alliances. With a diverse, multicultural workforce, we have spent over two decades excelling in IT-focused recruitment services and Enterprise ICT Operations management, becoming a trusted vendor partner for hig…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":2500.0,"contract_type":null,"skills":[]}
{"title":"Physiotherapist\/ Assistant (Clinic, Pedia)","description":"Responsibilities: Assist physiotherapists in implementing treatment plans for patients. Conduct therapeutic exercises and activities with patients under the supervision of a physiotherapist. Provide support in the application of modalities such as heat, cold, ultrasound, and electrical stimulation. Guide and educate patients on proper exercise techniques and home care programs. Assist in the maintenance and organization of treatment areas and equipment. Monitor and record patient progress and r…","category.label":"Healthcare & Nursing Jobs","category.tag":"healthcare-nursing-jobs","salary_min":42000.0,"contract_type":null,"skills":["manage physiotherapy staff","develop patient treatment strategies","exude enthusiasm during the action sessions","create cooperation modalities","geology","photography","perform ultrasound","electrical discharge","train medical staff on nutrition","Ensure correct use of bakery equipment","monitor therapeutic progress"]}
{"title":"Quantity Surveyor\/ Senior (Structural Steel\/ Construction Industry) URGENT","description":"Responsibilities: Perform quantity take-off and cost analysis for materials from drawings. Collaborate with project teams to ensure accurate measurement and costing of project activities. Analyze project specifications and drawings to identify potential cost savings and value engineering opportunities. Manage and monitor project budgets. Estimate project revenue and profit by monitoring project budget and providing regular updates. Liaise with the relevant authorities to obtain pre-construction…","category.label":"Trade & Construction Jobs","category.tag":"trade-construction-jobs","salary_min":60000.0,"contract_type":null,"skills":["prepare forecasts for take-off and landing","analyse goal progress","create project specifications","identify new recycling opportunities","manage operational budgets","manage profitability","manage budgets","prepare film continuity reports","liaise with local authorities","pre-blend tobacco leaves"]}
{"title":"Freelance Ghostwriter","description":"We are seeking talented ghostwriters to join our fast-growing community of top talent in the publishing industry. Reedsy's vetted group of freelancers have worked with bestselling authors like Stephen King, Suzane Collins (The Hunger Games) E.L. James (Fifty Shades of Grey), or Originals (Adam Grant). Requirements Our selection requirements are: 3 years of ghostwriting experience. Experience working with traditional publishers. Demonstrated experience on at least 5 published books that are well…","category.label":"Creative & Design Jobs","category.tag":"creative-design-jobs","salary_min":38000.0,"contract_type":"contract","skills":["Bible texts"]}
{"title":"R&D Intern - Mechanical Engineering","description":"Rapsodo is a Sports Technology company with offices in the USA, Singapore, Turkey & Japan. We develop sports analytics products that are data-driven, portable and easy-to-use to empower athletes at all skill levels to analyse and improve their performance. From Major League Baseball star pitchers to Golf tour players, athletes use Rapsodo technology to up their game across the world. Trusted by coaches and players from youths to professionals, Rapsodo provides real-time insights for all-time pe…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":1.0,"contract_type":"contract","skills":[]}
{"title":"HVAC\/ACMV | Field Service Manager (Engineering\/North)","description":"Responsibilities: Manage and oversee field service operations for the Air Conditioning, Mechanical Ventilation, and HVAC industry in the North region. Lead a team of field service technicians and support staff to ensure efficient and timely service delivery. Develop and implement service strategies to meet customer satisfaction and business objectives. Monitor and analyze key performance indicators to identify areas for improvement and optimize service performance. Collaborate with cross-functi…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":54000.0,"contract_type":null,"skills":["manage maintenance operations","unmanned air systems","hydraulic fracturing","domestic cooling systems","lead a team in fishery services","set up equipment in a timely manner","plan engineering activities","identify customer objectives","track key performance indicators","identify improvement actions","optimise production","install sill pan"]}
{"title":"Compliance Officer (MNC, Precision Tools)","description":"Responsibilities: Provide legal counseling and guidance on compliance matters within a multinational company (MNC). Develop and implement compliance programs and policies in accordance with applicable laws and regulations. Monitor and assess compliance risks and ensure measures are in place to mitigate those risks. Conduct compliance training and awareness programs for employees. Review, draft, and negotiate contracts and agreements with compliance considerations. Stay updated on changes in law…","category.label":"Legal Jobs","category.tag":"legal-jobs","salary_min":90000.0,"contract_type":null,"skills":["provide counselling on abortion","evaluate implementation of safety procedures","perform contract compliance audits","ensure cage safety requirements are followed","perform dating coaching","arrange audit","negotiate terms with suppliers","keep updated on innovations in various business fields"]}
{"title":"Senior, Project Engineer (Energy Solutions\/ACMV)","description":"Responsibilities: Manage and oversee projects related to Air Conditioning and Mechanical Ventilation (ACMV) systems. Coordinate with clients, architects, suppliers, and subcontractors to ensure successful project execution. Review and analyze project requirements and design specifications. Provide technical expertise and support in the selection and procurement of ACMV equipment and systems. Create detailed design drawings using AutoCAD software. Prepare project schedules, budgets, and resource…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":24000.0,"contract_type":null,"skills":["manage several projects","unmanned air systems","hydraulic fracturing","apply HACCP","debt systems","liaise between theatre direction and design team","ensure sentence execution","ensure conformance to jewel design specifications","provide technical expertise","support witnesses","plan procurement of meteorological equipment","apply HACCP","draft design specifications","create AutoCAD drawings","develop project schedule"]}
{"title":"Cloud Infrastructure Engineer \/ DevOps Engineer (On-site Singapore)","description":"Job Title: DevOps Engineer - Cloud Infrastructure (APAC) ﻿Location: Singapore (on-site) ﻿MUST HAVE: Can speak both Mandarin and English Unlock the Future of Cloud Infrastructure in APAC with Us Are you ready to play a crucial role in optimizing and securing our cloud infrastructure across APAC, including China? Join our dynamic team as a DevOps Engineer, where you will be the go-to expert for all DevOps matters in the region. Key Responsibilities: Cloud Infrastructure Management: Maintain and o…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":69600.0,"contract_type":"contract","skills":["cloud monitoring and reporting","Chinese","English","Chinese","DevOps","manage cloud data and storage"]}
{"title":"Sales & Marketing - Managerial level (Industrial, Machinery)","description":"Responsibilities: Assist in developing and implementing sales and marketing strategies to drive business growth in the industrial equipment\/machinery industry. Support the Sales & Marketing Manager in managing key client accounts and building strong relationships with clients. Identify and develop new business opportunities, including expanding the company's client base. Participate in sales presentations and product demonstrations to potential clients. Conduct market research and competitor an…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":42000.0,"contract_type":null,"skills":["implement sales strategies","build business relationships","manage accounts","build business relationships","identify new business opportunities","screen clients of escort services","execute after sales activities","perform market research","organise a repertoire"]}
{"title":"Product Growth Manager - APAC.","description":"Position Title: Product Growth Manager - APAC Location: APAC Region About Us: Our client is at the cutting edge of financial innovation, offering advanced AI solutions that streamline research and due diligence for Private Equity (PE), Venture Capital (VC), and Banking. Founded by two highly respected entrepreneurs with a history of successful exits, our client has secured substantial funding from top-tier investors. They are already operational with some of the largest firms worldwide and are …","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":100000.0,"contract_type":null,"skills":[]}
{"title":"Refrigeration Engineer - Service Maintenance - URGENT","description":"Responsibilities: Provide technical support and troubleshooting assistance to customers regarding refrigeration systems and equipment. Diagnose and resolve technical issues on-site visits. Collaborate with cross-functional teams to identify and implement solutions to customer problems. Provide training and guidance to customers on the operation and maintenance of refrigeration systems. Create and maintain documentation, including troubleshooting guides and technical manuals. Participate in prod…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":48000.0,"contract_type":null,"skills":["provide technical expertise","troubleshoot","diagnose education problems","liaise with engineers","create solutions to problems","provide mentorship","compile content","provide user documentation","grind glass","watch scenes"]}
{"title":"Software Engineer - CT - FNC240724 008\/01","description":"Qualifications & Requirements: Recognised degree in Computer Science, IT or engineering with at least 5 years’ relevant experience in software development; Gone through at least one full software development lifecycle (SDLC) with experience in producing SDLC documentations; Experience in Agile development methodology and continuous integration; Experience in Spring Framework and Spring Boot will be an advantage; Experience in Message Queues; Experience in Solace will be an advantage; Experience…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":6000.0,"contract_type":"contract","skills":["write database documentation","linguistics","computer science","ICT infrastructure","mining engineering","web programming","systems development life-cycle","integrated development environment software","logic","integrated development environment software","biology","Agile development","execute integration testing","JavaScript Framework","blockchain openness","cut wires","reinsurance"]}
{"title":"Consumer Operations Team Lead\/Manager","description":"k-ID is on a mission to protect and empower kids and teens in the digital world. We’re looking for a dynamic and strategic Consumer Operations Lead to build and manage our customer service and operations team from the ground up. If you’re passionate about delivering excellent customer experiences and shaping the way families interact with online safety solutions, this role is for you. Customer Service Setup and Strategy: Develop and implement the customer service processes, tools, and policies …","category.label":"Customer Services Jobs","category.tag":"customer-services-jobs","salary_min":105000.0,"contract_type":null,"skills":["plan","economics","manage lottery operations","provide high quality customer service","surveying","manage aftersales processes to comply with business standards"]}
{"title":"Marketing Manager (Interior Appliances, Construction) - South","description":"Responsibilities: Department Head for Business Development and Marketing department. Develop and Implementation of comprehensive sales & marketing strategies for the company. Manage the overall brand positioning and messaging across all marketing channels. Revamp company website and update product offerings details to improve company awareness and visibility. Collaborate with cross-functional teams to align sales and marketing efforts with business objectives. Provide overall support and strate…","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":78000.0,"contract_type":null,"skills":["draw up marketing and sales plan","lead the brand strategic planning process","inspect planed woodstock","organise product display","promote social awareness","liaise with engineers","implement sales strategies","coordinate operational activities","shiatsu"]}
{"title":"Country events leader","description":"Ready to play ? We are the champs in crafting and slinging sporting goods, apparel, and equipment. Whether you're smashing goals or conquering the great outdoors, Decathlon's got your back – because winning is our favorite sport  What is our culture like ? Where decisions spark High-fives : Decathlon rocks a lively, sporty vibe where mistakes can turn into global victories. We tackle responsibilities with the same energy – turning challenges into triumphs  Our game plan? Preserving the world to…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":3600.0,"contract_type":null,"skills":["manage fitness goals","animate in the outdoors"]}
{"title":"Retail Service - Managerial role (Logistics Industry)","description":"Responsibilities: Manage day-to-day retail operations in a multinational company (MNC). Oversee the performance of the retail team and ensure excellent customer service. Develop and implement strategies to drive sales and achieve revenue targets. Ensure visual merchandising standards are maintained to enhance the overall shopping experience. Collaborate with the marketing team to develop and execute promotional activities. Monitor and control inventory levels to minimize stock discrepancies. An…","category.label":"Retail Jobs","category.tag":"retail-jobs","salary_min":33600.0,"contract_type":null,"skills":["carry out end of day accounts","coach staff for running the performance","provide high quality customer service","coordinate technological activities","achieve sales targets","coach team on visual merchandising","help coordinate promotional activities","maintain stock control systems","resolve equipment malfunctions"]}
{"title":"Senior, Admin Executive (Support role, Office)","description":"Responsibilities: Provide secretarial and administrative support to the office. Manage and maintain executives' calendars, schedules, and appointments. Coordinate and arrange travel arrangements and accommodations. Prepare and draft correspondence, reports, and presentations. Handle and prioritize incoming emails and phone calls. Maintain and update office documents, records, and filing systems. Assist in organizing and coordinating company events and meetings. Manage office supplies and ensure…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":54000.0,"contract_type":null,"skills":["carry out event management","plan rig work schedules","oversee all travel arrangements","write meeting reports","maintain records of phone calls","maintain electronic systems","assist with book events","maintain inventory of office supplies"]}
{"title":"BIM Coordinator - M&E - URGENT","description":"Responsibilities: Coordinate and manage Building Information Modeling (BIM) processes for Mechanical and Electrical (M&E) projects. Work closely with project teams to develop and implement BIM execution plans. Collaborate with engineers, architects, and other stakeholders to ensure accurate modeling and coordination of M&E systems. Create and maintain BIM models and libraries. Ensure cto maintain BIM standards and workflows. Provide training and support to project teams on BIM software and proc…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":65000.0,"contract_type":null,"skills":["coordinate components of the work","Oracle Data Integrator","GIMP","mechanical clocks","electrical equipment components","work closely with news teams","implement operational business plans","GIMP","collaborate with engineers","maintain plan for continuity of operations","develop terminology databases","define prop building methods","ensure gambling operational standards","GIMP","provide operational efficiency training to employees","GIMP"]}
{"title":"Marketing Manager (Automotive)","description":"Remuneration: $5,000 to $6,500 Responsibilities: Oversee and manage all marketing operations. Develop and implement comprehensive marketing strategies, including new product launches, budgeting, and activities for both new product sales and aftersales operations. Enhance brand awareness and appeal through strategic partnerships, sponsorships, and prospecting initiatives. Develop and execute CRM strategies to improve customer retention. Implement strategies to analyze customer and prospect demog…","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":60000.0,"contract_type":null,"skills":["manage lottery operations","collaborate in the development of marketing strategies","manage brand assets","build business relationships","collaborate in the development of marketing strategies","improve customer interaction","customise project methodologies","assess customer credibility"]}
{"title":"Test Analyst","description":"Test Planning and Strategy: Collaborate with cross-functional teams to understand project requirements and define comprehensive test plans. Develop test strategies, test cases, and test scripts based on project specifications. Manual Testing: Execute manual test cases to ensure the functionality, usability, and performance of software applications. Identify, document, and track software defects to resolution. Perform regression testing to validate the impact of bug fixes and changes. Test Docum…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":3500.0,"contract_type":null,"skills":["liaise with engineers","define technical requirements","develop test procedures","manage product testing","plan test flights","run test pressings","measure software usability","leather physical testing","manage ICT legacy implication","maintain system logs","Bosnian","conduct performance tests","report chimney defects","conduct performance tests"]}
{"title":"Service Coordinator (HVAC\/North)","description":"Responsibilities: Coordinate and schedule service appointments for HVAC systems in the North region. Receive and handle service requests and inquiries from customers. Assign service technicians to job sites and ensure timely arrival. Monitor and track service jobs to ensure completion within agreed timelines. Communicate with customers regarding service status and updates. Maintain accurate records of service activities, including work orders and service reports. Assist in managing inventory an…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":30000.0,"contract_type":null,"skills":["coordinate the activities of chimney sweeps","monitor customer inquiries","inspect cabin service equipment","set up equipment in a timely manner","monitor painting operations","ensure sentence execution","inform customers of activity changes","maintain records of maintenance interventions","deliver correspondence","operate nail gun"]}
{"title":"System Network Engineer - Junior Executive (AWS, DevOps)","description":"Responsibilities: Assist in network design, implementation, and maintenance. Support the installation and configuration of network equipment and systems. Monitor network performance and troubleshoot network issues. Collaborate with cross-functional teams to ensure the smooth operation of the network infrastructure. Assist in the planning and execution of network upgrades and enhancements. Perform network assessments and audits to identify and address security vulnerabilities. Create and maintai…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":36000.0,"contract_type":"contract","skills":["define ICT network design policies","build fences","database","schedule maintenance of airport electrical systems","analyse network configuration and performance","perform ICT troubleshooting","coordinate engineering teams","maintain linen operation","deliver correspondence","maintain plan for continuity of operations","execute ICT audits","investigate security issues"]}
{"title":"German Speaking Freelance Recruiter - Work Remote","description":"The House Of Mercier is excited to offer a position for a German Speaking Freelance Recruiter to work remotely In this role, you will play a key part in sourcing and placing exceptional candidates within various industries for our esteemed clients. Your fluency in German, along with your understanding of the local job market, will be crucial in identifying and attracting top talent. This freelance position gives you the flexibility to work from anywhere while contributing to meaningful recruitm…","category.label":"Consultancy Jobs","category.tag":"consultancy-jobs","salary_min":40000.0,"contract_type":"contract","skills":["manage studio resourcing","identify talent","German","local geography"]}
{"title":"Warehouse Assistant","description":"5-days work week ($1800 basic  OT) Duties: Receive and check incoming stock. Loading and unloading of stock. Pick & Pack, Labelling before dispatch. Liaise with Sales Department for sales order requirement. Conduct stock take in orderly manner. Maintaining IT peripherals in good conditions. Maintaining warehouse cleanliness and tidiness. Other ad-hoc duties. Requirements: Able to start immediate will be good. Comfortable to work in warehouse environment. Preferably with IT product knowledge wil…","category.label":"Logistics & Warehouse Jobs","category.tag":"logistics-warehouse-jobs","salary_min":22800.0,"contract_type":"permanent","skills":["check deliveries on receipt","monitor flour unloading equipment","set up props in a timely manner","maintain inventory of tools","maintain work area cleanliness","work in professional sport environment","use IT tools"]}
{"title":"Software Engineer (Software\/Machine\/East)","description":"Responsibilities: Develop and implement software automation control solutions for machines in a manufacturing environment. Design, program, and test automation control systems for manufacturing processes. Collaborate with cross-functional teams to identify automation needs and requirements. Conduct feasibility studies and provide technical recommendations for automation projects. Troubleshoot and resolve automation control issues. Ensure compliance with safety and quality standards in automatio…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":30000.0,"contract_type":null,"skills":["oversee development of software","automation technology","landscape design","maintain control systems for automated equipment","manufacturing processes","liaise with engineers","identify service requirements","execute feasibility study","create technical plans","verify feasibility","detect product defects","ensure compliance with safety legislation"]}
{"title":"RTL Design Engineer","description":"Participate in mix-signal IC product design: Chip\/block level RTL design and implementation. Design signal processing blocks from algorithm, convert Algorithms to digital design. Architecture definition according to product spec. Participate in block and chip level verification : Participate in block\/system level digital\/mix-signal test bench development . Requirements Bachelor or Master’s degree in Electrical\/Electronic engineering 5 years of transistor-level design experience A team player th…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":120000.0,"contract_type":"permanent","skills":["operate audio-signal processors","imprint circuit design onto wafers","signal cues to announcers","landscape architecture","Cain and Abel","manage system testing","adapt costumes","acquire system component","energy","in-circuit test","teamwork principles","OpenEdge Advanced Business Language","vessel electrical system","telecommunications engineering","design optical systems"]}
{"title":"Project Manager (LTA Projects, Construction) - East","description":"Responsibilities: Assist in the management and coordination of electrical engineering projects. Support project managers in developing project plans, schedules, and budgets. Coordinate and communicate with project teams, subcontractors, and suppliers. Monitor project progress and ensure adherence to project plans and specifications. Assist in resolving any issues or challenges that may arise during the project execution. Conduct regular site inspections and quality control checks. Assist in the…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":54000.0,"contract_type":null,"skills":["carry out energy management of facilities","electrical engineering","prepare timelines for pipeline development projects","coordinate construction activities","document project progress","ensure compliance with construction project deadline","deal with unforeseen incidents in hospitality","ensure annual safety inspections"]}
{"title":"Assistant Engineer (Semicon\/Instrument Product) - East","description":"Responsibilities: Assist in the development and improvement of semiconductor\/instrument products. Participate in product testing and evaluation to ensure quality and performance. Collaborate with design engineers to implement design changes and enhancements. Conduct data analysis and report findings to support product development. Assist in troubleshooting and resolving technical issues related to the products. Assist in the creation and maintenance of product documentation. Support in coordina…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":30000.0,"contract_type":null,"skills":["deliver correspondence","develop instrumentation systems","inspect semiconductor components","manage performance light quality","test concrete","algorithms","recommend product improvements","perform data analysis","report facts","manage rubber products development","perform ICT troubleshooting","deliver correspondence","assist in the production of laboratory documentation"]}
{"title":"Part - Time English Teacher (Hiring - January 2025)","description":"Teaching with Boutique Education We are only able to consider candidates who are Singaporeans \/ PR at this time.  Boutique Education is a preferred education provider for families of children of all ages in international schools in Singapore. Our mission - instilling a love for learning. https:\/\/www.youtube.com\/watch?vvtT6dTTIFkg&featur We specialise in: Personalised 1 to 1 tuition Small group classes Homeschooling Special education Holiday camps Requirements Roles and Responsibilities: Design …","category.label":"Part time Jobs","category.tag":"part-time-jobs","salary_min":12000.0,"contract_type":null,"skills":["develop educational materials on art therapy","energy"]}
{"title":"Senior, Marketing Executive (FMCG, Beauty)","description":"Responsibilities: Develop and implement marketing strategies to promote beauty and cosmetics products in the FMCG industry. Create and execute marketing campaigns to drive brand awareness, customer engagement, and sales. Manage and optimize digital marketing channels, including social media, websites, and email marketing. Collaborate with cross-functional teams to develop marketing collateral, such as brochures, product descriptions, and packaging. Conduct market research and competitor analysi…","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":48000.0,"contract_type":null,"skills":["collaborate in the development of marketing strategies","sell cosmetics","plan marketing campaigns","apply customer engagement strategy","manage content development projects","social mediation","aesthetics","execute email marketing","liaise with engineers","develop digital content","produce content for tourism brochures","perform market research","news analytics"]}
{"title":"Electrical Maintenance Engineer (Entry Level, Electrical Power Engineering)","description":"Entry level with specialization in Electrical Power Engineering subject Monday to Friday, 8.30 am to 5.15 pm Location: Jurong Island (with transport provided) Salary: $3,300  $280 Allowance Responsibilities You will join the Maintenance Section to upkeep the manufacturing plants equipped with latest technology and advanced engineering control, and support the Maintenance Manager in accomplishing corporate business objectives. The Daily Manage maintenance and instrumentation activities for facil…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":39600.0,"contract_type":null,"skills":["operate dimmer equipment","implement operational business plans","design electric power systems","plan maintenance activities"]}
{"title":"Systems Engineer - CT-FNC240528 012\/02","description":"We are seeking a skilled RHEL Systems Engineer to join our dynamic team and contribute to our innovative projects. As an RHEL Systems Engineer, you will be responsible for managing and supporting our Red Hat Enterprise Linux (RHEL) environments. Your expertise in RHEL operations, installation, hardening, upgrade, and patching will be crucial to ensuring the stability and security of our systems. Experience with Azure is a plus and will be advantageous in this role. Key Responsibilities: RHEL Op…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":5500.0,"contract_type":"contract","skills":["Apache Tomcat","plan","logic","cloud monitoring and reporting","SMED","Microsoft Access"]}
{"title":"Retail Sport Specialist (Orchard) - 3 Months Part-Time Contract","description":"Hello future Decathlonian Born in France, we are one of the world’s largest sports retailers. We are passionate about sports and delighting our customers with top notch service Our motto? \"We move people through the wonders of sport\". We have 15 stores across Singapore, and many more to come ;) Why work with us ? 1) A great workplace with great people 2) Limitless personal & professional growth 3) SPORTS  If you… - Live & share passion for sport - Are service oriented, going the extra mile to p…","category.label":"Part time Jobs","category.tag":"part-time-jobs","salary_min":11.0,"contract_type":null,"skills":["focus on service"]}
{"title":"Project Manager- Payments SME (Principal)","description":"Principal, Payments, Singapore Key responsibilities of this position include: Cultivate and build long term relationships with senior executive clients (i.e., C-suite, Business heads, VPs) of companies in the Financial Services Sector (Payment's transformation) Perform as a subject matter expert for payment solutions transformation programs and advise, shape and provide solutions to business challenges presented by the client. Lead a team of consultants and business analysts for the end-to-end …","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":12000.0,"contract_type":null,"skills":["build business relationships","resolve difficult account allocation cases","spelling","develop strategy to solve problems","offer financial services","calculate wages","lead a team in water management"]}
{"title":"Senior, Service Operations Engineer (ACMV\/HVAC\/North)","description":"Responsibilities: Lead and manage service operations within the Air Conditioning, Mechanical Ventilation, and HVAC industry. Oversee the day-to-day service operations, including maintenance, repair, and installation. Manage a team of technicians and ensure efficient and timely service delivery. Develop and implement service strategies to meet customer satisfaction and business objectives. Monitor and analyze key performance indicators to identify areas for improvement. Collaborate with customer…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":28800.0,"contract_type":null,"skills":["manage lottery operations","unmanned air systems","hydraulic fracturing","domestic cooling systems","supervise daily information operations","sell bicycles","manage a team","set up equipment in a timely manner","plan engineering activities","identify customer objectives","track key performance indicators","identify improvement actions","be empathic to production team"]}
{"title":"Senior Interior Designer","description":"Key Responsibilities: Lead and oversee the conceptualization and design development of luxury hospitality and entertainment projects, ensuring aesthetic excellence and functionality. Cooperate with clients, architects, and project teams to deliver innovative design solutions that meet project objectives and budget requirements. Develop and present detailed design concepts, space planning, and mood boards. Manage all aspects of FF&E selection, sourcing, and specification, ensuring materials and …","category.label":"Consultancy Jobs","category.tag":"consultancy-jobs","salary_min":60000.0,"contract_type":"permanent","skills":["collaborate in the development of marketing strategies","ensure visual quality of the set","collaborate with technical experts on artworks","apply systemic design thinking","define evaluation objectives and scope","update design results during rehearsals","train planning","snowboard","manage technical aspects of vineyard production","drive trams","rhetoric","procurement legislation","process spatial information","appropriate raw materials for specific spirits","Assembly","drive trams","R"]}
{"title":"Art Director\/ Managerial (Marketing, Creative Agency)","description":"Responsibilities: Lead and manage the creative direction and vision for book covers and marketing materials. Collaborate with authors, designers, and marketing teams to develop compelling visual concepts. Create and oversee the production of book covers, promotional materials, and artwork. Ensure consistency and quality in all visual assets across different platforms. Stay updated with industry trends and competition to provide innovative design solutions. Manage and coordinate multiple project…","category.label":"Creative & Design Jobs","category.tag":"creative-design-jobs","salary_min":36000.0,"contract_type":null,"skills":["manage development of promotional material","collaborate with designers","determine visual concepts","manage production of destination promotional materials","ensure visual quality of the set","apply systemic design thinking","manage several projects"]}
{"title":"Senior Financial Analyst (With Big 4 experience)","description":"With Big 4 experience added advantage At least 3 to 5 years of relevant experience Location: One North Salary up to $5,500  AWS  VB Key Responsibilities: Financial Analysis and Reporting: Analyze and report monthly, quarterly, and annual financial performance (actual, forecast, budget) for institutions within the organization. Prepare consolidated financials for management and statutory reporting. Review accuracy of headcount and patient volumes in consolidated reports. Analyze institutions' fi…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":54000.0,"contract_type":null,"skills":["financial forecasting","Brightspace","develop with cloud services","Vyper","financial analysis","prepare financial projections","generate reconciliation reports","prepare well data sheets","analyse data about clients"]}
{"title":"Data Engineer (Big Query, Composer, Dataproc, ETL, GCP Tools)","description":"We are seeking a skilled and motivated Data Engineer with expertise in Google Cloud Platform tools such as BigQuery, Composer, Dataproc, and ETL processes. The ideal candidate will have a strong background in designing, implementing, and optimizing data pipelines and workflows. You will play a key role in ensuring our data infrastructure is scalable, efficient, and reliable to support our data-driven decision-making processes. Key Responsibilities: Design and Development: Develop, construct, te…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":7500.0,"contract_type":null,"skills":["Serbian","develop with cloud services","XQuery","ecology","Oracle Data Integrator","establish data processes","archaeology","develop data processing applications","data mining","manage workflow processes","cloud monitoring and reporting","Process-based management","oversee development of software","remove excess glue"]}
{"title":"Sales Manager","description":"Responsibilities: Develop and implement sales strategies to achieve company sales targets and objectives. Manage and motivate a team of sales representatives to drive sales performance. Identify and develop new business opportunities, including expanding the company's client base and market reach. Build and maintain strong relationships with key clients and partners. Oversee the entire sales process, from lead generation to closing deals. Monitor market trends and competitor activities to effec…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":60000.0,"contract_type":null,"skills":["collaborate in the development of marketing strategies","motivate staff to reach sales targets","achieve sales targets","identify new business opportunities","identify market niches","build business relationships","execute after sales activities","Welsh","track price trends"]}
{"title":"Head of HR","description":"Partner with the Global Talent team, HR, and Business leaders to create and implement integrated talent management strategies, tools, and processes to drive a culture of career growth, talent mobility, performance accountability and leadership development. Lead strong succession planning and long-term projections of leader vacancy needs, developing creative and effective approaches to bridging gaps in the short term and long term. Provide expertise in areas of leadership and team development, o…","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":9000.0,"contract_type":null,"skills":["develop technological improvement strategies","manage personal progression","forecast future levels of business","develop design ideas cooperatively","liaise with architects","provide technical expertise"]}
{"title":"Social Media & Content Strategist Internship (Hiring - January 2025)","description":"The Boutique Group of Companies is a Singapore-based organization consisting of four companies: Boutique Education Pte Ltd, Host Events Pte Ltd, Frenchic Pte Ltd, and Bertie x Odie Pte Ltd. We are currently seeking a motivated and detail-oriented individual to join our team as a Marketing Assistant. In this role, you will support our marketing efforts across our brands and contribute to the overall success of our marketing campaigns. Your responsibilities will include assisting in creating and …","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":7200.0,"contract_type":"contract","skills":["Serbian","service-oriented modelling","assist in developing marketing campaigns","spelling","Cain and Abel"]}
{"title":"L&D, Manager \/ Senior Manager(With ACTA \/ ACLP)","description":"Minimum with 8 years of L&D experience in a large-scale organization Possess ACLP\/ACTA Manager level: up to $9,000; Senior Manager level: up to $13,000 Location: Upper Changi Road Job Purpose: The Manager\/Senior Manager will be responsible for leading a team within the Corporate Learning Centre to enhance and drive commercial and operational excellence through targeted upskilling and reskilling initiatives. This role is crucial in improving customer experience and ensuring excellence across var…","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":102000.0,"contract_type":null,"skills":["lead a team","implement operational business plans","monitor concrete curing process","manage rubber products development","assess HACCP implementation in plants","improve customer interaction","ensure core uniformity"]}
{"title":"Electrical\/ Maintenance Technician (O&G)","description":"Responsibilities: Coordinate and schedule maintenance activities for electrical systems in the construction industry. Collaborate with project managers and contractors to ensure timely and effective maintenance. Monitor and track maintenance progress to ensure compliance with project timelines. Manage maintenance budgets and ensure cost-effective solutions. Prepare reports and documentation related to maintenance activities. Ensure compliance with safety regulations and industry standards. Coor…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":24000.0,"contract_type":null,"skills":["plan maintenance activities","vehicle electrical systems","construction industry","liaise with logistics management teams","set up equipment in a timely manner","monitor recommendation follow-up","ensure compliance with construction project deadline","manage operational budgets","ensure cost efficiency in food manufacturing","archive documentation related to work","ensure compliance with safety legislation"]}
{"title":"Marine Coordinator (0090 July 2024)","description":"As a Marine Coordinator at Royal Ocean Marine client (Shipmanagement) , you will play a pivotal role in supporting the company's marine operations. You will be responsible for a variety of tasks, including: Coordinating and overseeing marine activities and operations Managing documentation related to vessel certificates and stationery Arranging travel logistics for superintendents, including visa applications Handling invoicing and updating application forms for class audits and other vessel-re…","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":3000.0,"contract_type":null,"skills":["advise on tanker operations","coordinate the activities of chimney sweeps","oversee all travel arrangements","carry out order intake","questioned document examination","fine arts"]}
{"title":"Aviation Manager\/ Operations (Logistics, Fuel)","description":"Responsibilities: Manage and oversee aviation logistics operations. Ensure smooth and efficient logistics processes. Develop and implement logistics strategies to meet customer satisfaction and business objectives. Manage a team of logistics staff and provide guidance and support. Collaborate with internal departments and external stakeholders to ensure seamless logistics operations. Monitor and analyze key performance indicators to identify areas for improvement. Ensure compliance with regulat…","category.label":"Logistics & Warehouse Jobs","category.tag":"logistics-warehouse-jobs","salary_min":72000.0,"contract_type":null,"skills":["maintain inventory of airport operations","Ensure correct use of bakery equipment","coordinate technological activities","identify customer objectives","manage a team","provide advice on pet training","liaise with colleagues","consultation","ensure smooth on board operations","track key performance indicators","identify improvement actions","ensure aircraft compliance with regulation","reprography"]}
{"title":"Design Manager (Interior Office)","description":"Remuneration: $7,000 to $10,000 with Variable Bonus Responsibilities: Lead and manage a team designers. Lead project communication, liaising with design, clients, construction, supplier, and contractors’ teams. Oversee design and creativity on projects from concept design and space planning to development and presentation. Produce concept work using hand sketches and a variety of digital and traditional media. Produce and check drawing packages for schematic and detail design stages. Attend cli…","category.label":"Creative & Design Jobs","category.tag":"creative-design-jobs","salary_min":90000.0,"contract_type":null,"skills":["manage a team","manage content development projects","liaise with specialist contractors for well operations","consult with design team","develop design concept","train planning","development delays","define creative components","draw design sketches","prepare detailed working drawings for interior design","design piers","examine gems"]}
{"title":"Credit Control officer","description":"Location: East Industry: MNC within Aerospace Communicate with customers to solve collection issues and gain payment commitments, while building rapport and a positive relationship with global strategic account Check stopped orders report on a daily basis for the assigned region and\/or product line. Review the overdue status and risk development of the customer before releasing the order Conduct customer review of the new and existing customers and recommend credit lines according to the global…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":2800.0,"contract_type":"contract","skills":["communicate with customers","resolve shipment issues","monitor credit institutes","establish customer rapport","check deliveries on receipt","program a CNC controller","Islam","evaluate clients' progress","maintain relationship with customers","examine credit ratings"]}
{"title":"Client Service Executive\/ Officer (Distribution)","description":"Responsibilities: Provide excellent customer service and support in the supply chain industry. Handle customer inquiries, orders, and complaints in a timely and professional manner. Manage and maintain customer accounts, ensuring accurate and up-to-date information. Coordinate with internal teams to ensure smooth order processing and delivery. Proactively communicate with customers regarding order status, delays, and any issues. Collaborate with logistics and warehouse teams to address customer…","category.label":"Customer Services Jobs","category.tag":"customer-services-jobs","salary_min":30000.0,"contract_type":null,"skills":["provide fitness customer service","supply chain management","monitor customer inquiries","perform customer management","keep up-to-date with regulations","liaise with engineers","ensure correct goods labelling","inform customers of activity changes","satisfy customers"]}
{"title":"SS WELDER-(Gulf Exp\/Singapore U Turn)","description":"Job Description We are seeking an experienced SS Welder with Gulf experience or Singapore U Turn experience to join our team in the manufacturing industry. The ideal candidate should have 4-5 years of relevant work experience and be skilled in stainless steel welding. Responsibilities: . Perform stainless steel welding according to specifications . Read and interpret blueprints and welding process specifications . Inspect and test welds to ensure they meet quality standards . Operate and mainta…","category.label":"Manufacturing Jobs","category.tag":"manufacturing-jobs","salary_min":384.0,"contract_type":"permanent","skills":["Bosnian","manage athletes","mix moulding and casting material","perform welding inspection","plastic welding","read assembly drawings","welding techniques","repair mould defects","operate tote board"]}
{"title":"Academic Schedule Coordinator","description":"Job Responsibilities: Plan and prepare schedules for courses offered Plan and assign Adult Educators (AE-Trainers) Plan and allocate classrooms Ensuring that information is up to date across all platforms Publish and open training cohorts for registration via online platforms Liaising with AEs regarding trainers’ availability. Manage training resources Handle requests from Sales team, Customer Relations team, and Curriculum team for changes in schedules Requirements: Min. diploma. Good written …","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":30000.0,"contract_type":"permanent","skills":["plan learning curriculum","ensure mining records are maintained","ensure curriculum adherence","liaise with geology professionals","coordinate operational activities","adjust production schedule"]}
{"title":"Systems Electrical Design Engineer (Hi-Precision Automation)","description":"Responsibilities: Provide designing electrical systems and subsystems in accordance with the system specifications. Creating safety protection and electrical interlock design solutions for the company machinery. Building a design motion profiles and control mechanisms for service mode. Carry out new and existing product safety specifications. Lead projects to improve products that require updates to comply with new or updated standards. Oversee external vendors and contractors to ensure test fi…","category.label":"Energy, Oil & Gas Jobs","category.tag":"energy-oil-gas-jobs","salary_min":60000.0,"contract_type":null,"skills":["assemble electrical components","ensure safety of mobile electrical systems","standard sizing systems for clothing","ensure conformity to specifications","evaluate mine development projects","manage discarded products","keep updated on innovations in various business fields","audit contractors","test edge crush"]}
{"title":"Digital Marketing\/ Marcom (Event, Real Estate)","description":"Responsibilities: Assist in the development and implementation of digital marketing strategies to drive brand awareness and lead generation. Create and manage digital marketing campaigns across various online platforms. Analyze and optimize marketing campaigns to maximize ROI. Assist in the planning and execution of marketing events and promotions. Manage social media accounts and engage with online communities. Coordinate with external vendors and agencies to ensure smooth execution of marketi…","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":61200.0,"contract_type":null,"skills":["deliver correspondence","collaborate in the development of marketing strategies","build a strategic marketing plan for destination management","plan marketing campaigns","conduct search engine optimisation","maximise sales revenues","deliver correspondence","plan event marketing for promotional campaigns","social media management","build community relations","liaise with distribution channel managers","ensure sentence execution"]}
{"title":"Senior Accountant\/Assistant Finance Manager","description":"The Senior Accountant\/Assistant Finance Manager is responsible for maintaining day-to-day financial reporting and regulatory compliance needs of our business. The person will work closely with the company's cross-country team, while reporting to head of finance. Key Responsibilities Ensure timely and accurate month end closing and prepare monthly reports including monthly financial statements, cash flow statements and management reporting Ensure compliance of financial records and controls with…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":4000.0,"contract_type":null,"skills":["oversee freight-related financial documentation","identify with the company's goals","ensure contract termination and follow-up","prepare financial statements","ensure compliance with disclosure criteria of accounting information","handle cash flow","financial management"]}
{"title":"Service Technical Assistant (Power\/Energy\/ACMV)","description":"Responsibilities: Assist in the coordination of service activities for power, energy, and ACMV systems. Provide technical support to service technicians and engineers. Prepare and update service reports, documentation, and records. Assist in fault diagnosis and troubleshooting of power, energy, and ACMV systems. Coordinate with clients, suppliers, and internal teams to ensure smooth service operations. Monitor service schedules and ensure timely completion of service tasks. Support the procurem…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":30000.0,"contract_type":null,"skills":["coordinate operational activities","energy","energy","ATM systems","provide technical expertise","ensure that shipment contents correspond with shipping documentation","respond to electrical power contingencies","energy","nuclear energy","sell bicycles","ATM systems","liaise with engineers","ensure smooth on board operations","control taxi schedules","ensure incident free execution of voyages"]}
{"title":"Corporate Sales Executive","description":"Job Scope: Responsible for the entire sales cycle Actively explore new business accounts and develop client base Conduct cold calls and face-to-face meetings with clients Enjoy interacting and communicating with people, maintain good rapport with our IT Business Partners Follow-up on leads and sales inquires Closing sales and driven to achieve monthly sales target Requirements: A winner with a hunter role mindset Self-starter, result-driven, energetic & positive thinking Excited about the oppor…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":30000.0,"contract_type":"permanent","skills":["identify new business opportunities","initiate contact with sellers","empathise with outdoor groups","establish customer rapport","tend dry-press","set sales promotions","close sales at auction","achieve sales targets","swim","exercise self-reflection","results-based management","astronomy","systems thinking"]}
{"title":"Engineer, Medical Imaging Product URGENT","description":"Responsibilities: Provide technical support to customers regarding medical imaging systems. Diagnose and troubleshoot issues with medical imaging equipment. Collaborate with cross-functional teams to develop and implement solutions to customer problems. Create and maintain documentation, including troubleshooting guides and technical manuals. Provide training and guidance to customers on the operation and maintenance of medical imaging systems. Assist in the installation and configuration of me…","category.label":"Healthcare & Nursing Jobs","category.tag":"healthcare-nursing-jobs","salary_min":48000.0,"contract_type":null,"skills":["provide technical expertise","diagnose problems with vehicles","operate medical imaging equipment","coordinate engineering teams","create solutions to problems","compile content","provide user documentation","provide mentorship","configuration of the tote room hardware"]}
{"title":"Admin Support Executive (Mailroom)","description":"About Sleek Through proprietary software and AI, along with a focus on customer delight, Sleek makes the back-office easy for micro SMEs.We give Entrepreneurs time back to focus on what they love doing - growing their business and being with customers. With a surging number of Entrepreneurs globally, we are innovating in a highly lucrative space.We operate 3 business segments: Corporate Secretary : Automating the company incorporation, secretarial, filing, Nominee Director, mailroom and immigra…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":2500.0,"contract_type":null,"skills":[]}
{"title":"Mathematics Specialist \/ Tutor","description":"About the Job TCA believes that continually innovating, challenging and redefining the boundaries of education in Mathematics is the best way to benefit our students and stay ahead of the latest examination and competition trends. Poised for rapid growth across Asia, we are inviting individuals who are top performers in their field and who share our vision to join us. Working hours: 4 weekdays  1 weekend. Duties: Conduct weekly regular classes. Create content and curriculum for worksheets. Prov…","category.label":"Teaching Jobs","category.tag":"teaching-jobs","salary_min":24000.0,"contract_type":"permanent","skills":["participate in training sessions","compile course material"]}
{"title":"Manager - Technical (Security\/ CCTV)","description":"Responsibilities: Manage and oversee the technical aspects of security system projects, specifically CCTV systems. Lead and supervise a team of technicians and engineers in the installation, maintenance, and troubleshooting of CCTV systems. Collaborate with clients to understand their security requirements and provide customized solutions. Conduct site surveys and assessments to determine optimal locations for CCTV cameras and equipment. Design and develop CCTV system architectures and infrastr…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":72000.0,"contract_type":null,"skills":["manage technical aspects of vineyard production","security panels","administer ICT system","supervise dental technician staff","Slovenian","troubleshoot website","administer ICT system","liaise with engineers","provide customised products","conduct engineering site audits","operate video equipment","align software with system architectures"]}
{"title":"IT Project Manager","description":"Project Planning and Initiation: Define project scope, goals, and deliverables in collaboration with stakeholders. Develop detailed project plans, including timelines, budgets, and resource requirements. Conduct feasibility studies and risk assessments. Execution and Monitoring: Lead project teams in the execution of project plans. Monitor and track project progress against defined timelines and milestones. Identify and resolve issues to ensure successful project delivery. Collaborate with cros…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":7000.0,"contract_type":null,"skills":["define evaluation objectives and scope","evaluate project plans","execute feasibility study","verify feasibility","oversee wetlands in project development","manage project metrics","cooperate to resolve information issues","ensure sentence execution"]}
{"title":"Freelance Illustrator","description":"We are seeking talented book designers to join our fast-growing community of the industry's top publishing professionals. Reedsy's vetted group of freelancers have worked on a range of widely acclaimed novels such as The Hunger Games, Originals (Adam grant), and His Dark Materials (Phillip Pullman) series. Requirements - Have 3 years of experience in illustration. - A solid portfolio Experience working for a renowned publishing company or a history of high-quality work with a bestselling author…","category.label":"Creative & Design Jobs","category.tag":"creative-design-jobs","salary_min":38000.0,"contract_type":"contract","skills":[]}
{"title":"Creative Manager\/ Director (2D Design & 3D Design)","description":"Responsibilities: Lead and manage the creative team in developing and executing 2D and 3D experiential creative projects. Conceptualize and design creative concepts and solutions for various projects, including exhibitions, events, and installations. Collaborate with clients to understand their objectives and deliver impactful and innovative designs. Provide guidance and mentorship to junior designers and artists. Oversee the entire creative process, from concept development to final execution.…","category.label":"Creative & Design Jobs","category.tag":"creative-design-jobs","salary_min":90000.0,"contract_type":null,"skills":["lead the dental team","develop artistic project budgets","translate artistic concepts to technical designs","liaise with engineers","translate artistic concepts to technical designs","provide mentorship","adjust the work during the creative process","develop program ideas","ensure sentence execution"]}
{"title":"Assistant\/ Sales Account Director (Creative\/ Marketing Agency)","description":"Responsibilities: Manage and cultivate relationships with key clients in order to maximize business opportunities and drive revenue growth. Develop and implement strategic account plans to achieve sales targets and objectives. Identify new business opportunities within existing accounts and collaborate with the sales team to secure new clients. Lead client presentations and demonstrate deep understanding of client needs and industry trends. Provide exceptional client service by addressing clien…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":90000.0,"contract_type":null,"skills":["manage relationships with stakeholders","maximise sales revenues","manage revenue","develop account strategy","identify new business opportunities","prospect new customers","coach clients","provide fitness customer service","create camelbacks"]}
{"title":"Energy Manager (M&E\/ACMV\/North)","description":"Responsibilities: Manage and optimize energy consumption for M&E\/ACMV systems. Analyze energy data and identify areas for improvement and energy conservation. Implement energy efficiency measures and strategies. Monitor and track energy consumption and performance of systems. Collaborate with stakeholders and vendors to implement energy-saving initiatives. Ensure compliance with energy regulations and standards. Provide technical expertise and guidance on energy management. Prepare reports and …","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":80000.0,"contract_type":null,"skills":["assess areas for power line installation","ATM systems","analyse gambling data","identify new recycling opportunities","develop energy saving concepts","analyse energy consumption","negotiate with stakeholders","develop energy saving concepts","ensure compliance with shipment regulations","provide technical expertise","energy therapy","compile appraisal reports","watch scenes"]}
{"title":"Automotive Accessories Sales Executive","description":"Key Account Management Sales Account Management Car Accessories Automotive Solutions Wholesales  Retail Online Salary Package: SGD3000 - SGD4800 Job Location: Singapore West Fourth Lok Yang Road, near Pioneer MRT station Job Types: Permanent, Full time, Onsite, 5 days Business Sector: Automotive Accessories Distribution, Wholesale, Customisation & Solutions Provider. Job Responsibilities: Create, nurture and respond to sales opportunities and close sales orders. Establish quarterly and annual s…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":30000.0,"contract_type":"permanent","skills":["anger management","electric drives","repair jewellery","install vehicle accessories","develop aftersale policies","determine charges for customer services","Capture One","identify new business opportunities","process customer orders","establish draft annual schedules for vessels"]}
{"title":"Demand Planning Manager - Associate level (Manufacturing, Purchasing)","description":"Responsibilities: Assist in the development and implementation of procurement strategies, policies, and procedures in the trading business. Support the Purchasing Planning Manager in sourcing and evaluating suppliers, negotiating favorable terms and conditions. Collaborate with cross-functional teams to gather purchasing requirements and create purchase orders. Monitor and manage supplier relationships, ensuring timely and accurate delivery of goods and services. Utilize SAP system to process p…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":54000.0,"contract_type":null,"skills":["deliver correspondence","set organisational policies","business model","identify suppliers","negotiate employment agreements","liaise with engineers","oversee production requirements","issue purchase orders","maintain relationship with suppliers","set up equipment in a timely manner"]}
{"title":"Technician, Lift Maintenance - MNC","description":"Responsibilities: Perform routine maintenance and repair works on lifts and escalators. Conduct inspections and testing to ensure compliance with safety standards. Troubleshoot and diagnose issues with lift systems. Replace faulty parts and components as necessary. Maintain accurate records of maintenance activities and repairs. Collaborate with team members and service providers to ensure timely and effective maintenance. Adhere to company policies and procedures. Requirements Nitec in Enginee…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":30000.0,"contract_type":null,"skills":["perform minor repairs to equipment","perform quality audits","ensure compliance with safety legislation","diagnose problems with vehicles","replace defect components","maintain records of maintenance interventions","liaise with engineers","set up equipment in a timely manner","adhere to standard procedures"]}
{"title":"Interior Project Manager (Commercial) - East","description":"Responsibilities: Manage and oversee renovation and construction projects. Coordinate and collaborate with project teams, subcontractors, and suppliers. Develop and maintain project schedules and budgets. Monitor and manage the progress of construction activities according to project plans. Ensure compliance with safety regulations and procedures. Review and approve design drawings and specifications. Resolve any issues or challenges that may arise during construction. Conduct regular site insp…","category.label":"Trade & Construction Jobs","category.tag":"trade-construction-jobs","salary_min":54000.0,"contract_type":null,"skills":["manage construction archive","liaise with engineers","energy","develop project schedule","coordinate construction activities","plan","ensure compliance with safety legislation","draft design specifications","deal with unforeseen incidents in hospitality","oversee vineyard floor activities"]}
{"title":"Training Administration (HR, Learning & Development)","description":"Responsibilities: Assist in the coordination and administration of training programs and initiatives. Collaborate with trainers and subject matter experts to develop training materials and resources. Ensure training materials are up-to-date and readily available. Coordinate logistics for training sessions, including venue booking, participant registration, and equipment setup. Assist in the scheduling and coordination of training events. Maintain accurate training records and prepare reports. P…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":30000.0,"contract_type":null,"skills":["deliver correspondence","plan art educational activities","liaise with industry experts","create training materials","keep up-to-date with training subjects","plan workshop activity","deliver correspondence","carry out event management","ensure mining records are maintained","prepare wood production reports"]}
{"title":"Cashier (5-day work week)","description":"We are looking for a Cashier to manage all transactions with customers accurately and efficiently. Responsibilities Manage transactions with customers using POS system Collect payments whether in cash or cashless payment Resolve customer complaints, guide them and provide relevant information Greet customers when entering or leaving the store Maintain clean and tidy checkout areas Track transactions on balance sheets and report any discrepancies Requirements Strong communication and time manage…","category.label":"Retail Jobs","category.tag":"retail-jobs","salary_min":22860.0,"contract_type":null,"skills":["manage accounts","manage loan applications","handle customer complaints","satisfy customers","maintain check-out area cleanliness","investigate complaints about improper waste handling","manage resources","apply HACCP"]}
{"title":"Warehouse Assistant (Semicon Industry\/Driver\/West)","description":"Responsibilities: Receive, inspect, and record incoming goods and materials. Perform accurate picking and packing of orders. Prepare and arrange shipments for outgoing goods. Maintain inventory accuracy and ensure proper storage of products. Perform regular stock checks and cycle counts. Assist in maintaining a clean and organized warehouse environment. Follow safety procedures and guidelines at all times. Requirements Minimum GCE 'N' Levels or equivalent. Prior experience in a warehouse or log…","category.label":"Logistics & Warehouse Jobs","category.tag":"logistics-warehouse-jobs","salary_min":24000.0,"contract_type":null,"skills":["repair clocks","maintain inventory of rented items","handle delivery of furniture goods","coordinate shipments of waste materials","maintain inventory of tools","Ensure correct use of bakery equipment","monitor recommendation follow-up","maintain a safe, hygienic and secure working environment","follow airport safety procedures","operate band saw","sensors","medicines","watch scenes"]}
{"title":"Executive, Learning & Development (HR, Logistics Industry)","description":"Responsibilities: Design and implement learning and development programs to enhance the skills and knowledge of employees in the logistics industry. Identify training needs and conduct training needs analysis to develop targeted learning solutions. Create and deliver engaging training sessions, workshops, and e-learning modules tailored to the specific needs of logistics professionals. Collaborate with internal stakeholders, such as HR and operations teams, to ensure alignment between learning …","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":44400.0,"contract_type":null,"skills":["construct individual learning plans","energy","logistics","identify training needs","identify training needs","use learning strategies","develop e-learning plan","communicate with stakeholders","develop a coaching style"]}
{"title":"Workplace Safety and Health Officer cum Senior Fire Safety Manager -","description":"Job summary Our client is a established integrated facilities management organization and is recruiting this role due to new major project. Key selling points Attractive Remuneration Package and Benefits Team Oriented Working Environment Professional Growth and Personal Development Opportunities Job Responsibilities Participate in the development, implementation, and improvement of WSH\/EHS programs. Attend safety-oriented meetings and compile safety reports as directed. Conduct regular inspecti…","category.label":"Scientific & QA Jobs","category.tag":"scientific-qa-jobs","salary_min":54000.0,"contract_type":null,"skills":["support implementation of quality management systems","JSSS","organise project meetings","write inspection reports","attend castings"]}
{"title":"Senior Sales Manager","description":"Sinch is a global leader in cloud communications, offering a diverse range of messaging, voice, and email solutions that empower businesses to connect with their customers seamlessly. Our tools are designed to help enterprises build and maintain meaningful relationships with their audiences, with a strong emphasis on scalability, security, and innovation. Essence of the Role Reporting to the Head of Sales, APAC, the Senior Sales Manager will focus on driving new business growth across the APAC …","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":116128.0,"contract_type":null,"skills":["identify new business opportunities"]}
{"title":"Project Manager\/ Lead (Construction, EPC Projects)","description":"Responsibilities: Lead and oversee construction projects from initiation to completion. Develop and implement project management strategies and processes. Coordinate and collaborate with project teams, subcontractors, and suppliers. Establish project goals, objectives, and deliverables. Monitor project progress and ensure adherence to timelines and budgets. Manage project risks and resolve any issues that may arise during construction. Review and approve design drawings and specifications. Cond…","category.label":"Trade & Construction Jobs","category.tag":"trade-construction-jobs","salary_min":66000.0,"contract_type":null,"skills":["coordinate construction activities","Lean project management","study topics","liaise with engineers","energy","define evaluation objectives and scope","document project progress","ensure adherence to the constitution","manage project changes","deal with unforeseen incidents in hospitality","draft design specifications"]}
{"title":"Sales Engineer\/ Assistant (Semicon\/East)","description":"Responsibilities: Identify and develop new business opportunities within the semiconductor industry for the company's instrument products. Build and maintain strong relationships with existing clients to ensure customer satisfaction and repeat business. Deliver technical presentations and demonstrations to potential clients to showcase the features and benefits of the company's instrument products. Understand customer requirements and provide technical solutions tailored to their needs. Prepare…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":36000.0,"contract_type":null,"skills":["identify new business opportunities","semiconductors","maintain relationship with customers","guarantee customer satisfaction","provide technical expertise","demonstrate products' features","identify customer requirements","provide technical expertise","communicate production plan","watch scenes"]}
{"title":"Design Engineer, Switchboard Marine","description":"Responsibilities: Design and develop marine switchboards and electrical systems. Create detailed electrical design drawings. Collaborate with cross-functional teams to ensure design requirements are met. Review and analyze design specifications and standards. Perform engineering calculations to ensure switchboards meet safety and performance standards. Participate in design reviews and provide technical expertise. Assist in the testing and commissioning of marine switchboards. Stay updated with…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":50400.0,"contract_type":null,"skills":["design electrical systems","draft design specifications","liaise with engineers","ensure conformance to jewel design specifications","ensure conformance to jewel design specifications","perform surveying calculations","ensure safety in electrical power operations","participate in technical aspects of the production","provide technical expertise","design puppets","manage inspections of equipment","install power lines"]}
{"title":"Account Manager","description":"Role: We’re looking for an experienced account manager who will be the main point of contact for clients, responsible for managing client relationships and ensuring their satisfaction. You will oversee and coordinate projects, collaborating with internal teams including creative, copy, and media buying. This includes reporting directly to management, you will provide updates on project status and client feedback. With your strong system-building skills, you will establish efficient processes to…","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":36000.0,"contract_type":"permanent","skills":["ensure point of sale material availability","customer relationship management","ensure sanitation","manage several projects","coordinate engineering teams","report to captain","prepare reports on sanitation","tend dry-press","teach survival skills","implement mineral processes"]}
{"title":"Personal Assistant to Director","description":"Aethir is the leading DePIN, Enterprise-grade, AI-focused GPU-as-a-Service provider in the market. Leveraging a highly distributed cloud computing infrastructure allows GPU providers to serve AI and gaming customers at scale. Aethir aims to serve enterprise AI clients who need the world’s most powerful AI chips at scale, and also to support hundreds of thousands of cloud gaming players with best-in-class experiences around the world. All of this is accomplished with a decentralized architecture…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":60000.0,"contract_type":null,"skills":[]}
{"title":"Project Manager- Telco (Principal)","description":"Level: Principal Consultant Location: Singapore Infosys Consulting is the management consulting arm of Infosys, a global leader in consulting, technology, and outsourcing and next generation services, with 200,000 employees enabling clients in more than 50 countries. A pioneer in breaking down the barriers between strategy and execution, Infosys Consulting delivers superior business value to its clients by advising them on strategy and process optimization as well as IT-enabled transformation, …","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":12000.0,"contract_type":null,"skills":[]}
{"title":"Laboratory Technician (Fire Assaying, Precious Metals)","description":"Responsibilities: Assist in the setup and operation of laboratory equipment and instruments. Conduct fire assaying tests on samples to determine the presence and quantity of gold and other precious metals. Prepare and process samples for analysis. Ensure accurate documentation and record-keeping of test results. Maintain cleanliness and organization of the laboratory. Follow safety protocols and adhere to quality control standards. Assist in troubleshooting equipment and process issues as requi…","category.label":"Scientific & QA Jobs","category.tag":"scientific-qa-jobs","salary_min":24000.0,"contract_type":null,"skills":["maintain laboratory equipment","perform body searches","characteristics of precious metals","collect samples for analysis","record production data for quality control","maintain work area cleanliness","follow airport safety procedures","adhere to standard procedures","prevent technical problems with stage equipment"]}
{"title":"Assistant\/ Director, Operations (Hospitality Industry)","description":"Responsibilities: Lead and oversee all operational aspects of recreational facility operations. Develop and implement strategies to optimize operational efficiency and customer satisfaction. Manage a team of operations staff and provide guidance and support. Ensure smooth and efficient facility operations, maintenance, and security. Collaborate with internal departments and external stakeholders to ensure seamless operations. Monitor and analyze key performance indicators to identify areas for …","category.label":"Customer Services Jobs","category.tag":"customer-services-jobs","salary_min":84000.0,"contract_type":null,"skills":["ensure smooth on board operations","coordinate technological activities","guarantee customer satisfaction","manage a team","provide advice on pet training","assume responsibility for maintaining a safe ship environment","liaise with engineers","consultation","ensure smooth on board operations","track key performance indicators","identify trees to fell"]}
{"title":"Marine Vessels Coordinator","description":"1. Assist SOQAD S\/I in upkeep of Marine Team related vessel Certificates 2. Prepare required Stationeries for the vessel upon Superintendents given the requisitions. 3. Travel Related a. Apply for On-board list for superintendents who sail in Japan water and send approved On-board list to vessel. b. Preparing SI’s travel application, audit papers , updating travel record and (Form2) Handling the notification to P&I for the Marine SIs embarking & disembarking of non-ship personnel as per establi…","category.label":"Scientific & QA Jobs","category.tag":"scientific-qa-jobs","salary_min":36000.0,"contract_type":null,"skills":["programme work according to incoming orders","assess trim of vessels","maintain transaction's reports","check travel documentation","organise mail deliveries","Haskell","maintain shipboard machinery"]}
{"title":"Ultra Pure Water Technician - URGENT","description":"Responsibilities: Assist in the design and implementation of wastewater treatment systems. Collaborate with engineers and technicians to develop and optimize wastewater treatment processes. Conduct feasibility studies and perform data analysis to identify areas for improvement. Assist in the operation and maintenance of wastewater treatment systems. Monitor and analyze wastewater quality and make recommendations for process adjustments. Ensure compliance with environmental regulations and stand…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":39600.0,"contract_type":null,"skills":["review waste-treatment facilities construction plans","liaise with engineers","supervise waste water treatments","execute feasibility study","perform data analysis","identify improvement actions","verify feasibility","accounting","ensure maintenance of fuel distribution facilities","measure water quality parameters","make decisions regarding forestry management","ensure compliance with environmental legislation"]}
{"title":"Maritime Insurance Specialist (Hull & Machinery)","description":"Perm 3 to 5 years of experience working in the insurance industry. Must be familair with insurance policies common in the shipping industry, like professional indemnity, Hull and Machinery, all risk, marine cargo, comprehensive general liability, products liability, public liability, directors and officer insurance and employers’ liability. Job Description Insurance Operations: Collaborate with the GGC to report on insurance cover arrangements, premiums, and recoveries. Liaise with brokers for …","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":60000.0,"contract_type":"contract","skills":["insurance market","golf","betting","tumbling machine parts","public offering","sell insurance","liaise with geology professionals"]}
{"title":"Business Development Manager (Heavy Equipment\/MHE)","description":"Responsibilities: Develop and implement sales strategies to achieve revenue targets and business growth in the Material Handling Equipment (MHE) and Construction Equipment industry. Manage a team of sales representatives and provide guidance and support to drive sales performance. Identify and develop new business opportunities, including expanding the company's client base. Build and maintain strong relationships with key clients and partners in the industry. Oversee the entire sales process, …","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":48000.0,"contract_type":null,"skills":["collaborate in the development of marketing strategies","achieve sales targets","operate material handling equipment","logic","secure heavy construction equipment","manage sales teams","provide advice on pet training","achieve sales targets","identify new business opportunities","screen clients of escort services","build business relationships","execute after sales activities"]}
{"title":"Senior, Sales Engineer (Mechanical\/Fire Protection\/Technology)","description":"Responsibilities: Identify and develop new business opportunities within the smoke detection, fire protection, and fire fighting system industry. Build and maintain strong relationships with existing clients to ensure customer satisfaction and repeat business. Deliver technical presentations and demonstrations to potential clients to showcase the features and benefits of the company's products. Prepare sales proposals and negotiate contracts with clients. Collaborate with internal teams to ensu…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":48000.0,"contract_type":null,"skills":["identify new business opportunities","fraud detection","radiation protection","fire-fighting systems","maintain relationship with customers","guarantee customer satisfaction","provide technical expertise","demonstrate products' features","produce sales reports","negotiate sales contracts","liaise with engineers"]}
{"title":"Treasury Analyst","description":"Location: Central As a Treasury Analyst, you will assist the Treasury Manager in various Treasury functions. Your responsibilities will include managing the Company’s group cash, working capital, and foreign exchange risk. This entails overseeing cash management activities, as well as planning and executing cash flow management for all business segments of the organization. You thrive on seeking out new opportunities and challenges. Oversee daily treasury operations and cash management activiti…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":4000.0,"contract_type":null,"skills":["manage the general ledger","operate financial instruments","manage cash flow","manage cash flow","Albanian","identify new business opportunities","schedule regular machine maintenance"]}
{"title":"Corporate Affairs Executive","description":"Due to our rapid expansion to serve more children, we invite people who have proven commitment and competence to join us in transforming the lives entrusted to us. We are looking for a hands-on & energetic Corporate Affairs Executive to help us grow awareness for the Autism Resource Centre (S) \/Pathlight School. Your primary role is to support the Corporate Affairs Manager in managing and executing effective Internal and External Communications functions in the areas of : 1. Communications Coor…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":3000.0,"contract_type":null,"skills":["consultation","problem-solving with digital tools","astronomy","marketing management","manage internal process of a sport organisation"]}
{"title":"Systems Application Engineer","description":"Our client is a fast-growing Unified Communications (UC), Audio-Visual (AV) and Information Technology (IT) solutions company, currently expanding the team and seeking a Systems Application Engineer. Job Description The ideal candidate is a self-starter, craves knowledge and finds joy in sharing ideas. The candidate would be responsible for finding creative solutions that fits into project requirements and is proactive in technical learning and executions. Responsibilities: Attending client mee…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":54000.0,"contract_type":null,"skills":["self-promote","demonstrate willingness to learn","develop creative ideas","develop creative ideas","prompt performers","learning technologies","surgery","adjust rotogravure press"]}
{"title":"Food Safety & Quality Manager (Team Lead)","description":"Responsibilities: Lead and manage the food safety and quality team to ensure compliance with food safety standards and regulations. Develop and implement food safety and quality policies, procedures, and guidelines. Conduct regular inspections and audits to ensure adherence to food safety protocols. Monitor and analyze quality data to identify trends and areas for improvement. Collaborate with cross-functional teams to address quality issues and implement corrective actions. Manage and maintain…","category.label":"Scientific & QA Jobs","category.tag":"scientific-qa-jobs","salary_min":66000.0,"contract_type":null,"skills":["ensure health and safety of dive teams","ensure compliance with shipment regulations","evaluate implementation of safety procedures","ensure annual safety inspections","ensure ongoing compliance with regulations","record production data for quality control","identify improvement actions","coordinate engineering teams","report chimney defects","manage corrective actions","manage lottery operations"]}
{"title":"Part - Time English Teacher (Hiring - January 2025)","description":"Teaching with Boutique Education We are only able to consider candidates who are Singaporeans \/ PR at this time.  Boutique Education is a preferred education provider for families of children of all ages in international schools in Singapore. Our mission - instilling a love for learning. https:\/\/www.youtube.com\/watch?vvtT6dTTIFkg&featur We specialise in: Personalised 1 to 1 tuition Small group classes Homeschooling Special education Holiday camps Requirements Roles and Responsibilities: Design …","category.label":"Part time Jobs","category.tag":"part-time-jobs","salary_min":12000.0,"contract_type":null,"skills":["develop educational materials on art therapy","energy"]}
{"title":"Senior, Marketing Executive (FMCG, Beauty)","description":"Responsibilities: Develop and implement marketing strategies to promote beauty and cosmetics products in the FMCG industry. Create and execute marketing campaigns to drive brand awareness, customer engagement, and sales. Manage and optimize digital marketing channels, including social media, websites, and email marketing. Collaborate with cross-functional teams to develop marketing collateral, such as brochures, product descriptions, and packaging. Conduct market research and competitor analysi…","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":48000.0,"contract_type":null,"skills":["collaborate in the development of marketing strategies","sell cosmetics","plan marketing campaigns","apply customer engagement strategy","manage content development projects","social mediation","aesthetics","execute email marketing","liaise with engineers","develop digital content","produce content for tourism brochures","perform market research","news analytics"]}
{"title":"Electrical Maintenance Engineer (Entry Level, Electrical Power Engineering)","description":"Entry level with specialization in Electrical Power Engineering subject Monday to Friday, 8.30 am to 5.15 pm Location: Jurong Island (with transport provided) Salary: $3,300  $280 Allowance Responsibilities You will join the Maintenance Section to upkeep the manufacturing plants equipped with latest technology and advanced engineering control, and support the Maintenance Manager in accomplishing corporate business objectives. The Daily Manage maintenance and instrumentation activities for facil…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":39600.0,"contract_type":null,"skills":["operate dimmer equipment","implement operational business plans","design electric power systems","plan maintenance activities"]}
{"title":"Systems Engineer - CT-FNC240528 012\/02","description":"We are seeking a skilled RHEL Systems Engineer to join our dynamic team and contribute to our innovative projects. As an RHEL Systems Engineer, you will be responsible for managing and supporting our Red Hat Enterprise Linux (RHEL) environments. Your expertise in RHEL operations, installation, hardening, upgrade, and patching will be crucial to ensuring the stability and security of our systems. Experience with Azure is a plus and will be advantageous in this role. Key Responsibilities: RHEL Op…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":5500.0,"contract_type":"contract","skills":["Apache Tomcat","plan","logic","cloud monitoring and reporting","SMED","Microsoft Access"]}
{"title":"Retail Sport Specialist (Orchard) - 3 Months Part-Time Contract","description":"Hello future Decathlonian Born in France, we are one of the world’s largest sports retailers. We are passionate about sports and delighting our customers with top notch service Our motto? \"We move people through the wonders of sport\". We have 15 stores across Singapore, and many more to come ;) Why work with us ? 1) A great workplace with great people 2) Limitless personal & professional growth 3) SPORTS  If you… - Live & share passion for sport - Are service oriented, going the extra mile to p…","category.label":"Part time Jobs","category.tag":"part-time-jobs","salary_min":11.0,"contract_type":null,"skills":["focus on service"]}
{"title":"Project Manager- Payments SME (Principal)","description":"Principal, Payments, Singapore Key responsibilities of this position include: Cultivate and build long term relationships with senior executive clients (i.e., C-suite, Business heads, VPs) of companies in the Financial Services Sector (Payment's transformation) Perform as a subject matter expert for payment solutions transformation programs and advise, shape and provide solutions to business challenges presented by the client. Lead a team of consultants and business analysts for the end-to-end …","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":12000.0,"contract_type":null,"skills":["build business relationships","resolve difficult account allocation cases","spelling","develop strategy to solve problems","offer financial services","calculate wages","lead a team in water management"]}
{"title":"Senior, Service Operations Engineer (ACMV\/HVAC\/North)","description":"Responsibilities: Lead and manage service operations within the Air Conditioning, Mechanical Ventilation, and HVAC industry. Oversee the day-to-day service operations, including maintenance, repair, and installation. Manage a team of technicians and ensure efficient and timely service delivery. Develop and implement service strategies to meet customer satisfaction and business objectives. Monitor and analyze key performance indicators to identify areas for improvement. Collaborate with customer…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":28800.0,"contract_type":null,"skills":["manage lottery operations","unmanned air systems","hydraulic fracturing","domestic cooling systems","supervise daily information operations","sell bicycles","manage a team","set up equipment in a timely manner","plan engineering activities","identify customer objectives","track key performance indicators","identify improvement actions","be empathic to production team"]}
{"title":"Senior Interior Designer","description":"Key Responsibilities: Lead and oversee the conceptualization and design development of luxury hospitality and entertainment projects, ensuring aesthetic excellence and functionality. Cooperate with clients, architects, and project teams to deliver innovative design solutions that meet project objectives and budget requirements. Develop and present detailed design concepts, space planning, and mood boards. Manage all aspects of FF&E selection, sourcing, and specification, ensuring materials and …","category.label":"Consultancy Jobs","category.tag":"consultancy-jobs","salary_min":60000.0,"contract_type":"permanent","skills":["collaborate in the development of marketing strategies","ensure visual quality of the set","collaborate with technical experts on artworks","apply systemic design thinking","define evaluation objectives and scope","update design results during rehearsals","train planning","snowboard","manage technical aspects of vineyard production","drive trams","rhetoric","procurement legislation","process spatial information","appropriate raw materials for specific spirits","Assembly","drive trams","R"]}
{"title":"Art Director\/ Managerial (Marketing, Creative Agency)","description":"Responsibilities: Lead and manage the creative direction and vision for book covers and marketing materials. Collaborate with authors, designers, and marketing teams to develop compelling visual concepts. Create and oversee the production of book covers, promotional materials, and artwork. Ensure consistency and quality in all visual assets across different platforms. Stay updated with industry trends and competition to provide innovative design solutions. Manage and coordinate multiple project…","category.label":"Creative & Design Jobs","category.tag":"creative-design-jobs","salary_min":36000.0,"contract_type":null,"skills":["manage development of promotional material","collaborate with designers","determine visual concepts","manage production of destination promotional materials","ensure visual quality of the set","apply systemic design thinking","manage several projects"]}
{"title":"Senior Financial Analyst (With Big 4 experience)","description":"With Big 4 experience added advantage At least 3 to 5 years of relevant experience Location: One North Salary up to $5,500  AWS  VB Key Responsibilities: Financial Analysis and Reporting: Analyze and report monthly, quarterly, and annual financial performance (actual, forecast, budget) for institutions within the organization. Prepare consolidated financials for management and statutory reporting. Review accuracy of headcount and patient volumes in consolidated reports. Analyze institutions' fi…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":54000.0,"contract_type":null,"skills":["financial forecasting","Brightspace","develop with cloud services","Vyper","financial analysis","prepare financial projections","generate reconciliation reports","prepare well data sheets","analyse data about clients"]}
{"title":"Data Engineer (Big Query, Composer, Dataproc, ETL, GCP Tools)","description":"We are seeking a skilled and motivated Data Engineer with expertise in Google Cloud Platform tools such as BigQuery, Composer, Dataproc, and ETL processes. The ideal candidate will have a strong background in designing, implementing, and optimizing data pipelines and workflows. You will play a key role in ensuring our data infrastructure is scalable, efficient, and reliable to support our data-driven decision-making processes. Key Responsibilities: Design and Development: Develop, construct, te…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":7500.0,"contract_type":null,"skills":["Serbian","develop with cloud services","XQuery","ecology","Oracle Data Integrator","establish data processes","archaeology","develop data processing applications","data mining","manage workflow processes","cloud monitoring and reporting","Process-based management","oversee development of software","remove excess glue"]}
{"title":"Sales Manager","description":"Responsibilities: Develop and implement sales strategies to achieve company sales targets and objectives. Manage and motivate a team of sales representatives to drive sales performance. Identify and develop new business opportunities, including expanding the company's client base and market reach. Build and maintain strong relationships with key clients and partners. Oversee the entire sales process, from lead generation to closing deals. Monitor market trends and competitor activities to effec…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":60000.0,"contract_type":null,"skills":["collaborate in the development of marketing strategies","motivate staff to reach sales targets","achieve sales targets","identify new business opportunities","identify market niches","build business relationships","execute after sales activities","Welsh","track price trends"]}
{"title":"Head of HR","description":"Partner with the Global Talent team, HR, and Business leaders to create and implement integrated talent management strategies, tools, and processes to drive a culture of career growth, talent mobility, performance accountability and leadership development. Lead strong succession planning and long-term projections of leader vacancy needs, developing creative and effective approaches to bridging gaps in the short term and long term. Provide expertise in areas of leadership and team development, o…","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":9000.0,"contract_type":null,"skills":["develop technological improvement strategies","manage personal progression","forecast future levels of business","develop design ideas cooperatively","liaise with architects","provide technical expertise"]}
{"title":"Social Media & Content Strategist Internship (Hiring - January 2025)","description":"The Boutique Group of Companies is a Singapore-based organization consisting of four companies: Boutique Education Pte Ltd, Host Events Pte Ltd, Frenchic Pte Ltd, and Bertie x Odie Pte Ltd. We are currently seeking a motivated and detail-oriented individual to join our team as a Marketing Assistant. In this role, you will support our marketing efforts across our brands and contribute to the overall success of our marketing campaigns. Your responsibilities will include assisting in creating and …","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":7200.0,"contract_type":"contract","skills":["Serbian","service-oriented modelling","assist in developing marketing campaigns","spelling","Cain and Abel"]}
{"title":"L&D, Manager \/ Senior Manager(With ACTA \/ ACLP)","description":"Minimum with 8 years of L&D experience in a large-scale organization Possess ACLP\/ACTA Manager level: up to $9,000; Senior Manager level: up to $13,000 Location: Upper Changi Road Job Purpose: The Manager\/Senior Manager will be responsible for leading a team within the Corporate Learning Centre to enhance and drive commercial and operational excellence through targeted upskilling and reskilling initiatives. This role is crucial in improving customer experience and ensuring excellence across var…","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":102000.0,"contract_type":null,"skills":["lead a team","implement operational business plans","monitor concrete curing process","manage rubber products development","assess HACCP implementation in plants","improve customer interaction","ensure core uniformity"]}
{"title":"Electrical\/ Maintenance Technician (O&G)","description":"Responsibilities: Coordinate and schedule maintenance activities for electrical systems in the construction industry. Collaborate with project managers and contractors to ensure timely and effective maintenance. Monitor and track maintenance progress to ensure compliance with project timelines. Manage maintenance budgets and ensure cost-effective solutions. Prepare reports and documentation related to maintenance activities. Ensure compliance with safety regulations and industry standards. Coor…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":24000.0,"contract_type":null,"skills":["plan maintenance activities","vehicle electrical systems","construction industry","liaise with logistics management teams","set up equipment in a timely manner","monitor recommendation follow-up","ensure compliance with construction project deadline","manage operational budgets","ensure cost efficiency in food manufacturing","archive documentation related to work","ensure compliance with safety legislation"]}
{"title":"Marine Coordinator (0090 July 2024)","description":"As a Marine Coordinator at Royal Ocean Marine client (Shipmanagement) , you will play a pivotal role in supporting the company's marine operations. You will be responsible for a variety of tasks, including: Coordinating and overseeing marine activities and operations Managing documentation related to vessel certificates and stationery Arranging travel logistics for superintendents, including visa applications Handling invoicing and updating application forms for class audits and other vessel-re…","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":3000.0,"contract_type":null,"skills":["advise on tanker operations","coordinate the activities of chimney sweeps","oversee all travel arrangements","carry out order intake","questioned document examination","fine arts"]}
{"title":"Aviation Manager\/ Operations (Logistics, Fuel)","description":"Responsibilities: Manage and oversee aviation logistics operations. Ensure smooth and efficient logistics processes. Develop and implement logistics strategies to meet customer satisfaction and business objectives. Manage a team of logistics staff and provide guidance and support. Collaborate with internal departments and external stakeholders to ensure seamless logistics operations. Monitor and analyze key performance indicators to identify areas for improvement. Ensure compliance with regulat…","category.label":"Logistics & Warehouse Jobs","category.tag":"logistics-warehouse-jobs","salary_min":72000.0,"contract_type":null,"skills":["maintain inventory of airport operations","Ensure correct use of bakery equipment","coordinate technological activities","identify customer objectives","manage a team","provide advice on pet training","liaise with colleagues","consultation","ensure smooth on board operations","track key performance indicators","identify improvement actions","ensure aircraft compliance with regulation","reprography"]}
{"title":"Design Manager (Interior Office)","description":"Remuneration: $7,000 to $10,000 with Variable Bonus Responsibilities: Lead and manage a team designers. Lead project communication, liaising with design, clients, construction, supplier, and contractors’ teams. Oversee design and creativity on projects from concept design and space planning to development and presentation. Produce concept work using hand sketches and a variety of digital and traditional media. Produce and check drawing packages for schematic and detail design stages. Attend cli…","category.label":"Creative & Design Jobs","category.tag":"creative-design-jobs","salary_min":90000.0,"contract_type":null,"skills":["manage a team","manage content development projects","liaise with specialist contractors for well operations","consult with design team","develop design concept","train planning","development delays","define creative components","draw design sketches","prepare detailed working drawings for interior design","design piers","examine gems"]}
{"title":"Credit Control officer","description":"Location: East Industry: MNC within Aerospace Communicate with customers to solve collection issues and gain payment commitments, while building rapport and a positive relationship with global strategic account Check stopped orders report on a daily basis for the assigned region and\/or product line. Review the overdue status and risk development of the customer before releasing the order Conduct customer review of the new and existing customers and recommend credit lines according to the global…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":2800.0,"contract_type":"contract","skills":["communicate with customers","resolve shipment issues","monitor credit institutes","establish customer rapport","check deliveries on receipt","program a CNC controller","Islam","evaluate clients' progress","maintain relationship with customers","examine credit ratings"]}
{"title":"Client Service Executive\/ Officer (Distribution)","description":"Responsibilities: Provide excellent customer service and support in the supply chain industry. Handle customer inquiries, orders, and complaints in a timely and professional manner. Manage and maintain customer accounts, ensuring accurate and up-to-date information. Coordinate with internal teams to ensure smooth order processing and delivery. Proactively communicate with customers regarding order status, delays, and any issues. Collaborate with logistics and warehouse teams to address customer…","category.label":"Customer Services Jobs","category.tag":"customer-services-jobs","salary_min":30000.0,"contract_type":null,"skills":["provide fitness customer service","supply chain management","monitor customer inquiries","perform customer management","keep up-to-date with regulations","liaise with engineers","ensure correct goods labelling","inform customers of activity changes","satisfy customers"]}
{"title":"SS WELDER-(Gulf Exp\/Singapore U Turn)","description":"Job Description We are seeking an experienced SS Welder with Gulf experience or Singapore U Turn experience to join our team in the manufacturing industry. The ideal candidate should have 4-5 years of relevant work experience and be skilled in stainless steel welding. Responsibilities: . Perform stainless steel welding according to specifications . Read and interpret blueprints and welding process specifications . Inspect and test welds to ensure they meet quality standards . Operate and mainta…","category.label":"Manufacturing Jobs","category.tag":"manufacturing-jobs","salary_min":384.0,"contract_type":"permanent","skills":["Bosnian","manage athletes","mix moulding and casting material","perform welding inspection","plastic welding","read assembly drawings","welding techniques","repair mould defects","operate tote board"]}
{"title":"Academic Schedule Coordinator","description":"Job Responsibilities: Plan and prepare schedules for courses offered Plan and assign Adult Educators (AE-Trainers) Plan and allocate classrooms Ensuring that information is up to date across all platforms Publish and open training cohorts for registration via online platforms Liaising with AEs regarding trainers’ availability. Manage training resources Handle requests from Sales team, Customer Relations team, and Curriculum team for changes in schedules Requirements: Min. diploma. Good written …","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":30000.0,"contract_type":"permanent","skills":["plan learning curriculum","ensure mining records are maintained","ensure curriculum adherence","liaise with geology professionals","coordinate operational activities","adjust production schedule"]}
{"title":"Systems Electrical Design Engineer (Hi-Precision Automation)","description":"Responsibilities: Provide designing electrical systems and subsystems in accordance with the system specifications. Creating safety protection and electrical interlock design solutions for the company machinery. Building a design motion profiles and control mechanisms for service mode. Carry out new and existing product safety specifications. Lead projects to improve products that require updates to comply with new or updated standards. Oversee external vendors and contractors to ensure test fi…","category.label":"Energy, Oil & Gas Jobs","category.tag":"energy-oil-gas-jobs","salary_min":60000.0,"contract_type":null,"skills":["assemble electrical components","ensure safety of mobile electrical systems","standard sizing systems for clothing","ensure conformity to specifications","evaluate mine development projects","manage discarded products","keep updated on innovations in various business fields","audit contractors","test edge crush"]}
{"title":"Digital Marketing\/ Marcom (Event, Real Estate)","description":"Responsibilities: Assist in the development and implementation of digital marketing strategies to drive brand awareness and lead generation. Create and manage digital marketing campaigns across various online platforms. Analyze and optimize marketing campaigns to maximize ROI. Assist in the planning and execution of marketing events and promotions. Manage social media accounts and engage with online communities. Coordinate with external vendors and agencies to ensure smooth execution of marketi…","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":61200.0,"contract_type":null,"skills":["deliver correspondence","collaborate in the development of marketing strategies","build a strategic marketing plan for destination management","plan marketing campaigns","conduct search engine optimisation","maximise sales revenues","deliver correspondence","plan event marketing for promotional campaigns","social media management","build community relations","liaise with distribution channel managers","ensure sentence execution"]}
{"title":"Senior Accountant\/Assistant Finance Manager","description":"The Senior Accountant\/Assistant Finance Manager is responsible for maintaining day-to-day financial reporting and regulatory compliance needs of our business. The person will work closely with the company's cross-country team, while reporting to head of finance. Key Responsibilities Ensure timely and accurate month end closing and prepare monthly reports including monthly financial statements, cash flow statements and management reporting Ensure compliance of financial records and controls with…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":4000.0,"contract_type":null,"skills":["oversee freight-related financial documentation","identify with the company's goals","ensure contract termination and follow-up","prepare financial statements","ensure compliance with disclosure criteria of accounting information","handle cash flow","financial management"]}
{"title":"Service Technical Assistant (Power\/Energy\/ACMV)","description":"Responsibilities: Assist in the coordination of service activities for power, energy, and ACMV systems. Provide technical support to service technicians and engineers. Prepare and update service reports, documentation, and records. Assist in fault diagnosis and troubleshooting of power, energy, and ACMV systems. Coordinate with clients, suppliers, and internal teams to ensure smooth service operations. Monitor service schedules and ensure timely completion of service tasks. Support the procurem…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":30000.0,"contract_type":null,"skills":["coordinate operational activities","energy","energy","ATM systems","provide technical expertise","ensure that shipment contents correspond with shipping documentation","respond to electrical power contingencies","energy","nuclear energy","sell bicycles","ATM systems","liaise with engineers","ensure smooth on board operations","control taxi schedules","ensure incident free execution of voyages"]}
{"title":"Corporate Sales Executive","description":"Job Scope: Responsible for the entire sales cycle Actively explore new business accounts and develop client base Conduct cold calls and face-to-face meetings with clients Enjoy interacting and communicating with people, maintain good rapport with our IT Business Partners Follow-up on leads and sales inquires Closing sales and driven to achieve monthly sales target Requirements: A winner with a hunter role mindset Self-starter, result-driven, energetic & positive thinking Excited about the oppor…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":30000.0,"contract_type":"permanent","skills":["identify new business opportunities","initiate contact with sellers","empathise with outdoor groups","establish customer rapport","tend dry-press","set sales promotions","close sales at auction","achieve sales targets","swim","exercise self-reflection","results-based management","astronomy","systems thinking"]}
{"title":"Engineer, Medical Imaging Product URGENT","description":"Responsibilities: Provide technical support to customers regarding medical imaging systems. Diagnose and troubleshoot issues with medical imaging equipment. Collaborate with cross-functional teams to develop and implement solutions to customer problems. Create and maintain documentation, including troubleshooting guides and technical manuals. Provide training and guidance to customers on the operation and maintenance of medical imaging systems. Assist in the installation and configuration of me…","category.label":"Healthcare & Nursing Jobs","category.tag":"healthcare-nursing-jobs","salary_min":48000.0,"contract_type":null,"skills":["provide technical expertise","diagnose problems with vehicles","operate medical imaging equipment","coordinate engineering teams","create solutions to problems","compile content","provide user documentation","provide mentorship","configuration of the tote room hardware"]}
{"title":"Admin Support Executive (Mailroom)","description":"About Sleek Through proprietary software and AI, along with a focus on customer delight, Sleek makes the back-office easy for micro SMEs.We give Entrepreneurs time back to focus on what they love doing - growing their business and being with customers. With a surging number of Entrepreneurs globally, we are innovating in a highly lucrative space.We operate 3 business segments: Corporate Secretary : Automating the company incorporation, secretarial, filing, Nominee Director, mailroom and immigra…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":2500.0,"contract_type":null,"skills":[]}
{"title":"Mathematics Specialist \/ Tutor","description":"About the Job TCA believes that continually innovating, challenging and redefining the boundaries of education in Mathematics is the best way to benefit our students and stay ahead of the latest examination and competition trends. Poised for rapid growth across Asia, we are inviting individuals who are top performers in their field and who share our vision to join us. Working hours: 4 weekdays  1 weekend. Duties: Conduct weekly regular classes. Create content and curriculum for worksheets. Prov…","category.label":"Teaching Jobs","category.tag":"teaching-jobs","salary_min":24000.0,"contract_type":"permanent","skills":["participate in training sessions","compile course material"]}
{"title":"Manager - Technical (Security\/ CCTV)","description":"Responsibilities: Manage and oversee the technical aspects of security system projects, specifically CCTV systems. Lead and supervise a team of technicians and engineers in the installation, maintenance, and troubleshooting of CCTV systems. Collaborate with clients to understand their security requirements and provide customized solutions. Conduct site surveys and assessments to determine optimal locations for CCTV cameras and equipment. Design and develop CCTV system architectures and infrastr…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":72000.0,"contract_type":null,"skills":["manage technical aspects of vineyard production","security panels","administer ICT system","supervise dental technician staff","Slovenian","troubleshoot website","administer ICT system","liaise with engineers","provide customised products","conduct engineering site audits","operate video equipment","align software with system architectures"]}
{"title":"IT Project Manager","description":"Project Planning and Initiation: Define project scope, goals, and deliverables in collaboration with stakeholders. Develop detailed project plans, including timelines, budgets, and resource requirements. Conduct feasibility studies and risk assessments. Execution and Monitoring: Lead project teams in the execution of project plans. Monitor and track project progress against defined timelines and milestones. Identify and resolve issues to ensure successful project delivery. Collaborate with cros…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":7000.0,"contract_type":null,"skills":["define evaluation objectives and scope","evaluate project plans","execute feasibility study","verify feasibility","oversee wetlands in project development","manage project metrics","cooperate to resolve information issues","ensure sentence execution"]}
{"title":"Freelance Illustrator","description":"We are seeking talented book designers to join our fast-growing community of the industry's top publishing professionals. Reedsy's vetted group of freelancers have worked on a range of widely acclaimed novels such as The Hunger Games, Originals (Adam grant), and His Dark Materials (Phillip Pullman) series. Requirements - Have 3 years of experience in illustration. - A solid portfolio Experience working for a renowned publishing company or a history of high-quality work with a bestselling author…","category.label":"Creative & Design Jobs","category.tag":"creative-design-jobs","salary_min":38000.0,"contract_type":"contract","skills":[]}
{"title":"Creative Manager\/ Director (2D Design & 3D Design)","description":"Responsibilities: Lead and manage the creative team in developing and executing 2D and 3D experiential creative projects. Conceptualize and design creative concepts and solutions for various projects, including exhibitions, events, and installations. Collaborate with clients to understand their objectives and deliver impactful and innovative designs. Provide guidance and mentorship to junior designers and artists. Oversee the entire creative process, from concept development to final execution.…","category.label":"Creative & Design Jobs","category.tag":"creative-design-jobs","salary_min":90000.0,"contract_type":null,"skills":["lead the dental team","develop artistic project budgets","translate artistic concepts to technical designs","liaise with engineers","translate artistic concepts to technical designs","provide mentorship","adjust the work during the creative process","develop program ideas","ensure sentence execution"]}
{"title":"Assistant\/ Sales Account Director (Creative\/ Marketing Agency)","description":"Responsibilities: Manage and cultivate relationships with key clients in order to maximize business opportunities and drive revenue growth. Develop and implement strategic account plans to achieve sales targets and objectives. Identify new business opportunities within existing accounts and collaborate with the sales team to secure new clients. Lead client presentations and demonstrate deep understanding of client needs and industry trends. Provide exceptional client service by addressing clien…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":90000.0,"contract_type":null,"skills":["manage relationships with stakeholders","maximise sales revenues","manage revenue","develop account strategy","identify new business opportunities","prospect new customers","coach clients","provide fitness customer service","create camelbacks"]}
{"title":"Energy Manager (M&E\/ACMV\/North)","description":"Responsibilities: Manage and optimize energy consumption for M&E\/ACMV systems. Analyze energy data and identify areas for improvement and energy conservation. Implement energy efficiency measures and strategies. Monitor and track energy consumption and performance of systems. Collaborate with stakeholders and vendors to implement energy-saving initiatives. Ensure compliance with energy regulations and standards. Provide technical expertise and guidance on energy management. Prepare reports and …","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":80000.0,"contract_type":null,"skills":["assess areas for power line installation","ATM systems","analyse gambling data","identify new recycling opportunities","develop energy saving concepts","analyse energy consumption","negotiate with stakeholders","develop energy saving concepts","ensure compliance with shipment regulations","provide technical expertise","energy therapy","compile appraisal reports","watch scenes"]}
{"title":"Automotive Accessories Sales Executive","description":"Key Account Management Sales Account Management Car Accessories Automotive Solutions Wholesales  Retail Online Salary Package: SGD3000 - SGD4800 Job Location: Singapore West Fourth Lok Yang Road, near Pioneer MRT station Job Types: Permanent, Full time, Onsite, 5 days Business Sector: Automotive Accessories Distribution, Wholesale, Customisation & Solutions Provider. Job Responsibilities: Create, nurture and respond to sales opportunities and close sales orders. Establish quarterly and annual s…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":30000.0,"contract_type":"permanent","skills":["anger management","electric drives","repair jewellery","install vehicle accessories","develop aftersale policies","determine charges for customer services","Capture One","identify new business opportunities","process customer orders","establish draft annual schedules for vessels"]}
{"title":"Demand Planning Manager - Associate level (Manufacturing, Purchasing)","description":"Responsibilities: Assist in the development and implementation of procurement strategies, policies, and procedures in the trading business. Support the Purchasing Planning Manager in sourcing and evaluating suppliers, negotiating favorable terms and conditions. Collaborate with cross-functional teams to gather purchasing requirements and create purchase orders. Monitor and manage supplier relationships, ensuring timely and accurate delivery of goods and services. Utilize SAP system to process p…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":54000.0,"contract_type":null,"skills":["deliver correspondence","set organisational policies","business model","identify suppliers","negotiate employment agreements","liaise with engineers","oversee production requirements","issue purchase orders","maintain relationship with suppliers","set up equipment in a timely manner"]}
{"title":"Technician, Lift Maintenance - MNC","description":"Responsibilities: Perform routine maintenance and repair works on lifts and escalators. Conduct inspections and testing to ensure compliance with safety standards. Troubleshoot and diagnose issues with lift systems. Replace faulty parts and components as necessary. Maintain accurate records of maintenance activities and repairs. Collaborate with team members and service providers to ensure timely and effective maintenance. Adhere to company policies and procedures. Requirements Nitec in Enginee…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":30000.0,"contract_type":null,"skills":["perform minor repairs to equipment","perform quality audits","ensure compliance with safety legislation","diagnose problems with vehicles","replace defect components","maintain records of maintenance interventions","liaise with engineers","set up equipment in a timely manner","adhere to standard procedures"]}
{"title":"Interior Project Manager (Commercial) - East","description":"Responsibilities: Manage and oversee renovation and construction projects. Coordinate and collaborate with project teams, subcontractors, and suppliers. Develop and maintain project schedules and budgets. Monitor and manage the progress of construction activities according to project plans. Ensure compliance with safety regulations and procedures. Review and approve design drawings and specifications. Resolve any issues or challenges that may arise during construction. Conduct regular site insp…","category.label":"Trade & Construction Jobs","category.tag":"trade-construction-jobs","salary_min":54000.0,"contract_type":null,"skills":["manage construction archive","liaise with engineers","energy","develop project schedule","coordinate construction activities","plan","ensure compliance with safety legislation","draft design specifications","deal with unforeseen incidents in hospitality","oversee vineyard floor activities"]}
{"title":"Training Administration (HR, Learning & Development)","description":"Responsibilities: Assist in the coordination and administration of training programs and initiatives. Collaborate with trainers and subject matter experts to develop training materials and resources. Ensure training materials are up-to-date and readily available. Coordinate logistics for training sessions, including venue booking, participant registration, and equipment setup. Assist in the scheduling and coordination of training events. Maintain accurate training records and prepare reports. P…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":30000.0,"contract_type":null,"skills":["deliver correspondence","plan art educational activities","liaise with industry experts","create training materials","keep up-to-date with training subjects","plan workshop activity","deliver correspondence","carry out event management","ensure mining records are maintained","prepare wood production reports"]}
{"title":"Cashier (5-day work week)","description":"We are looking for a Cashier to manage all transactions with customers accurately and efficiently. Responsibilities Manage transactions with customers using POS system Collect payments whether in cash or cashless payment Resolve customer complaints, guide them and provide relevant information Greet customers when entering or leaving the store Maintain clean and tidy checkout areas Track transactions on balance sheets and report any discrepancies Requirements Strong communication and time manage…","category.label":"Retail Jobs","category.tag":"retail-jobs","salary_min":22860.0,"contract_type":null,"skills":["manage accounts","manage loan applications","handle customer complaints","satisfy customers","maintain check-out area cleanliness","investigate complaints about improper waste handling","manage resources","apply HACCP"]}
{"title":"Warehouse Assistant (Semicon Industry\/Driver\/West)","description":"Responsibilities: Receive, inspect, and record incoming goods and materials. Perform accurate picking and packing of orders. Prepare and arrange shipments for outgoing goods. Maintain inventory accuracy and ensure proper storage of products. Perform regular stock checks and cycle counts. Assist in maintaining a clean and organized warehouse environment. Follow safety procedures and guidelines at all times. Requirements Minimum GCE 'N' Levels or equivalent. Prior experience in a warehouse or log…","category.label":"Logistics & Warehouse Jobs","category.tag":"logistics-warehouse-jobs","salary_min":24000.0,"contract_type":null,"skills":["repair clocks","maintain inventory of rented items","handle delivery of furniture goods","coordinate shipments of waste materials","maintain inventory of tools","Ensure correct use of bakery equipment","monitor recommendation follow-up","maintain a safe, hygienic and secure working environment","follow airport safety procedures","operate band saw","sensors","medicines","watch scenes"]}
{"title":"Executive, Learning & Development (HR, Logistics Industry)","description":"Responsibilities: Design and implement learning and development programs to enhance the skills and knowledge of employees in the logistics industry. Identify training needs and conduct training needs analysis to develop targeted learning solutions. Create and deliver engaging training sessions, workshops, and e-learning modules tailored to the specific needs of logistics professionals. Collaborate with internal stakeholders, such as HR and operations teams, to ensure alignment between learning …","category.label":"HR & Recruitment Jobs","category.tag":"hr-jobs","salary_min":44400.0,"contract_type":null,"skills":["construct individual learning plans","energy","logistics","identify training needs","identify training needs","use learning strategies","develop e-learning plan","communicate with stakeholders","develop a coaching style"]}
{"title":"Workplace Safety and Health Officer cum Senior Fire Safety Manager -","description":"Job summary Our client is a established integrated facilities management organization and is recruiting this role due to new major project. Key selling points Attractive Remuneration Package and Benefits Team Oriented Working Environment Professional Growth and Personal Development Opportunities Job Responsibilities Participate in the development, implementation, and improvement of WSH\/EHS programs. Attend safety-oriented meetings and compile safety reports as directed. Conduct regular inspecti…","category.label":"Scientific & QA Jobs","category.tag":"scientific-qa-jobs","salary_min":54000.0,"contract_type":null,"skills":["support implementation of quality management systems","JSSS","organise project meetings","write inspection reports","attend castings"]}
{"title":"Senior Sales Manager","description":"Sinch is a global leader in cloud communications, offering a diverse range of messaging, voice, and email solutions that empower businesses to connect with their customers seamlessly. Our tools are designed to help enterprises build and maintain meaningful relationships with their audiences, with a strong emphasis on scalability, security, and innovation. Essence of the Role Reporting to the Head of Sales, APAC, the Senior Sales Manager will focus on driving new business growth across the APAC …","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":116128.0,"contract_type":null,"skills":["identify new business opportunities"]}
{"title":"Project Manager\/ Lead (Construction, EPC Projects)","description":"Responsibilities: Lead and oversee construction projects from initiation to completion. Develop and implement project management strategies and processes. Coordinate and collaborate with project teams, subcontractors, and suppliers. Establish project goals, objectives, and deliverables. Monitor project progress and ensure adherence to timelines and budgets. Manage project risks and resolve any issues that may arise during construction. Review and approve design drawings and specifications. Cond…","category.label":"Trade & Construction Jobs","category.tag":"trade-construction-jobs","salary_min":66000.0,"contract_type":null,"skills":["coordinate construction activities","Lean project management","study topics","liaise with engineers","energy","define evaluation objectives and scope","document project progress","ensure adherence to the constitution","manage project changes","deal with unforeseen incidents in hospitality","draft design specifications"]}
{"title":"Sales Engineer\/ Assistant (Semicon\/East)","description":"Responsibilities: Identify and develop new business opportunities within the semiconductor industry for the company's instrument products. Build and maintain strong relationships with existing clients to ensure customer satisfaction and repeat business. Deliver technical presentations and demonstrations to potential clients to showcase the features and benefits of the company's instrument products. Understand customer requirements and provide technical solutions tailored to their needs. Prepare…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":36000.0,"contract_type":null,"skills":["identify new business opportunities","semiconductors","maintain relationship with customers","guarantee customer satisfaction","provide technical expertise","demonstrate products' features","identify customer requirements","provide technical expertise","communicate production plan","watch scenes"]}
{"title":"Design Engineer, Switchboard Marine","description":"Responsibilities: Design and develop marine switchboards and electrical systems. Create detailed electrical design drawings. Collaborate with cross-functional teams to ensure design requirements are met. Review and analyze design specifications and standards. Perform engineering calculations to ensure switchboards meet safety and performance standards. Participate in design reviews and provide technical expertise. Assist in the testing and commissioning of marine switchboards. Stay updated with…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":50400.0,"contract_type":null,"skills":["design electrical systems","draft design specifications","liaise with engineers","ensure conformance to jewel design specifications","ensure conformance to jewel design specifications","perform surveying calculations","ensure safety in electrical power operations","participate in technical aspects of the production","provide technical expertise","design puppets","manage inspections of equipment","install power lines"]}
{"title":"Account Manager","description":"Role: We’re looking for an experienced account manager who will be the main point of contact for clients, responsible for managing client relationships and ensuring their satisfaction. You will oversee and coordinate projects, collaborating with internal teams including creative, copy, and media buying. This includes reporting directly to management, you will provide updates on project status and client feedback. With your strong system-building skills, you will establish efficient processes to…","category.label":"PR, Advertising & Marketing Jobs","category.tag":"pr-advertising-marketing-jobs","salary_min":36000.0,"contract_type":"permanent","skills":["ensure point of sale material availability","customer relationship management","ensure sanitation","manage several projects","coordinate engineering teams","report to captain","prepare reports on sanitation","tend dry-press","teach survival skills","implement mineral processes"]}
{"title":"Personal Assistant to Director","description":"Aethir is the leading DePIN, Enterprise-grade, AI-focused GPU-as-a-Service provider in the market. Leveraging a highly distributed cloud computing infrastructure allows GPU providers to serve AI and gaming customers at scale. Aethir aims to serve enterprise AI clients who need the world’s most powerful AI chips at scale, and also to support hundreds of thousands of cloud gaming players with best-in-class experiences around the world. All of this is accomplished with a decentralized architecture…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":60000.0,"contract_type":null,"skills":[]}
{"title":"Project Manager- Telco (Principal)","description":"Level: Principal Consultant Location: Singapore Infosys Consulting is the management consulting arm of Infosys, a global leader in consulting, technology, and outsourcing and next generation services, with 200,000 employees enabling clients in more than 50 countries. A pioneer in breaking down the barriers between strategy and execution, Infosys Consulting delivers superior business value to its clients by advising them on strategy and process optimization as well as IT-enabled transformation, …","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":12000.0,"contract_type":null,"skills":[]}
{"title":"Laboratory Technician (Fire Assaying, Precious Metals)","description":"Responsibilities: Assist in the setup and operation of laboratory equipment and instruments. Conduct fire assaying tests on samples to determine the presence and quantity of gold and other precious metals. Prepare and process samples for analysis. Ensure accurate documentation and record-keeping of test results. Maintain cleanliness and organization of the laboratory. Follow safety protocols and adhere to quality control standards. Assist in troubleshooting equipment and process issues as requi…","category.label":"Scientific & QA Jobs","category.tag":"scientific-qa-jobs","salary_min":24000.0,"contract_type":null,"skills":["maintain laboratory equipment","perform body searches","characteristics of precious metals","collect samples for analysis","record production data for quality control","maintain work area cleanliness","follow airport safety procedures","adhere to standard procedures","prevent technical problems with stage equipment"]}
{"title":"Assistant\/ Director, Operations (Hospitality Industry)","description":"Responsibilities: Lead and oversee all operational aspects of recreational facility operations. Develop and implement strategies to optimize operational efficiency and customer satisfaction. Manage a team of operations staff and provide guidance and support. Ensure smooth and efficient facility operations, maintenance, and security. Collaborate with internal departments and external stakeholders to ensure seamless operations. Monitor and analyze key performance indicators to identify areas for …","category.label":"Customer Services Jobs","category.tag":"customer-services-jobs","salary_min":84000.0,"contract_type":null,"skills":["ensure smooth on board operations","coordinate technological activities","guarantee customer satisfaction","manage a team","provide advice on pet training","assume responsibility for maintaining a safe ship environment","liaise with engineers","consultation","ensure smooth on board operations","track key performance indicators","identify trees to fell"]}
{"title":"Marine Vessels Coordinator","description":"1. Assist SOQAD S\/I in upkeep of Marine Team related vessel Certificates 2. Prepare required Stationeries for the vessel upon Superintendents given the requisitions. 3. Travel Related a. Apply for On-board list for superintendents who sail in Japan water and send approved On-board list to vessel. b. Preparing SI’s travel application, audit papers , updating travel record and (Form2) Handling the notification to P&I for the Marine SIs embarking & disembarking of non-ship personnel as per establi…","category.label":"Scientific & QA Jobs","category.tag":"scientific-qa-jobs","salary_min":36000.0,"contract_type":null,"skills":["programme work according to incoming orders","assess trim of vessels","maintain transaction's reports","check travel documentation","organise mail deliveries","Haskell","maintain shipboard machinery"]}
{"title":"Ultra Pure Water Technician - URGENT","description":"Responsibilities: Assist in the design and implementation of wastewater treatment systems. Collaborate with engineers and technicians to develop and optimize wastewater treatment processes. Conduct feasibility studies and perform data analysis to identify areas for improvement. Assist in the operation and maintenance of wastewater treatment systems. Monitor and analyze wastewater quality and make recommendations for process adjustments. Ensure compliance with environmental regulations and stand…","category.label":"Engineering Jobs","category.tag":"engineering-jobs","salary_min":39600.0,"contract_type":null,"skills":["review waste-treatment facilities construction plans","liaise with engineers","supervise waste water treatments","execute feasibility study","perform data analysis","identify improvement actions","verify feasibility","accounting","ensure maintenance of fuel distribution facilities","measure water quality parameters","make decisions regarding forestry management","ensure compliance with environmental legislation"]}
{"title":"Maritime Insurance Specialist (Hull & Machinery)","description":"Perm 3 to 5 years of experience working in the insurance industry. Must be familair with insurance policies common in the shipping industry, like professional indemnity, Hull and Machinery, all risk, marine cargo, comprehensive general liability, products liability, public liability, directors and officer insurance and employers’ liability. Job Description Insurance Operations: Collaborate with the GGC to report on insurance cover arrangements, premiums, and recoveries. Liaise with brokers for …","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":60000.0,"contract_type":"contract","skills":["insurance market","golf","betting","tumbling machine parts","public offering","sell insurance","liaise with geology professionals"]}
{"title":"Business Development Manager (Heavy Equipment\/MHE)","description":"Responsibilities: Develop and implement sales strategies to achieve revenue targets and business growth in the Material Handling Equipment (MHE) and Construction Equipment industry. Manage a team of sales representatives and provide guidance and support to drive sales performance. Identify and develop new business opportunities, including expanding the company's client base. Build and maintain strong relationships with key clients and partners in the industry. Oversee the entire sales process, …","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":48000.0,"contract_type":null,"skills":["collaborate in the development of marketing strategies","achieve sales targets","operate material handling equipment","logic","secure heavy construction equipment","manage sales teams","provide advice on pet training","achieve sales targets","identify new business opportunities","screen clients of escort services","build business relationships","execute after sales activities"]}
{"title":"Senior, Sales Engineer (Mechanical\/Fire Protection\/Technology)","description":"Responsibilities: Identify and develop new business opportunities within the smoke detection, fire protection, and fire fighting system industry. Build and maintain strong relationships with existing clients to ensure customer satisfaction and repeat business. Deliver technical presentations and demonstrations to potential clients to showcase the features and benefits of the company's products. Prepare sales proposals and negotiate contracts with clients. Collaborate with internal teams to ensu…","category.label":"Sales Jobs","category.tag":"sales-jobs","salary_min":48000.0,"contract_type":null,"skills":["identify new business opportunities","fraud detection","radiation protection","fire-fighting systems","maintain relationship with customers","guarantee customer satisfaction","provide technical expertise","demonstrate products' features","produce sales reports","negotiate sales contracts","liaise with engineers"]}
{"title":"Treasury Analyst","description":"Location: Central As a Treasury Analyst, you will assist the Treasury Manager in various Treasury functions. Your responsibilities will include managing the Company’s group cash, working capital, and foreign exchange risk. This entails overseeing cash management activities, as well as planning and executing cash flow management for all business segments of the organization. You thrive on seeking out new opportunities and challenges. Oversee daily treasury operations and cash management activiti…","category.label":"Accounting & Finance Jobs","category.tag":"accounting-finance-jobs","salary_min":4000.0,"contract_type":null,"skills":["manage the general ledger","operate financial instruments","manage cash flow","manage cash flow","Albanian","identify new business opportunities","schedule regular machine maintenance"]}
{"title":"Corporate Affairs Executive","description":"Due to our rapid expansion to serve more children, we invite people who have proven commitment and competence to join us in transforming the lives entrusted to us. We are looking for a hands-on & energetic Corporate Affairs Executive to help us grow awareness for the Autism Resource Centre (S) \/Pathlight School. Your primary role is to support the Corporate Affairs Manager in managing and executing effective Internal and External Communications functions in the areas of : 1. Communications Coor…","category.label":"Admin Jobs","category.tag":"admin-jobs","salary_min":3000.0,"contract_type":null,"skills":["consultation","problem-solving with digital tools","astronomy","marketing management","manage internal process of a sport organisation"]}
{"title":"Systems Application Engineer","description":"Our client is a fast-growing Unified Communications (UC), Audio-Visual (AV) and Information Technology (IT) solutions company, currently expanding the team and seeking a Systems Application Engineer. Job Description The ideal candidate is a self-starter, craves knowledge and finds joy in sharing ideas. The candidate would be responsible for finding creative solutions that fits into project requirements and is proactive in technical learning and executions. Responsibilities: Attending client mee…","category.label":"IT Jobs","category.tag":"it-jobs","salary_min":54000.0,"contract_type":null,"skills":["self-promote","demonstrate willingness to learn","develop creative ideas","develop creative ideas","prompt performers","learning technologies","surgery","adjust rotogravure press"]}
{"title":"Food Safety & Quality Manager (Team Lead)","description":"Responsibilities: Lead and manage the food safety and quality team to ensure compliance with food safety standards and regulations. Develop and implement food safety and quality policies, procedures, and guidelines. Conduct regular inspections and audits to ensure adherence to food safety protocols. Monitor and analyze quality data to identify trends and areas for improvement. Collaborate with cross-functional teams to address quality issues and implement corrective actions. Manage and maintain…","category.label":"Scientific & QA Jobs","category.tag":"scientific-qa-jobs","salary_min":66000.0,"contract_type":null,"skills":["ensure health and safety of dive teams","ensure compliance with shipment regulations","evaluate implementation of safety procedures","ensure annual safety inspections","ensure ongoing compliance with regulations","record production data for quality control","identify improvement actions","coordinate engineering teams","report chimney defects","manage corrective actions","manage lottery operations"]}
