{
  "job_id": 921716,
  "company_name": "Corcoran Sawyer Smith",
  "title": "Marketing Coordinator",
  "description_x": "Job descriptionA leading real estate firm in New Jersey is seeking an administrative Marketing Coordinator with some experience in graphic design. You will be working closely with our fun, kind, ambitious members of the sales team and our dynamic executive team on a daily basis. This is an opportunity to be part of a fast-growing, highly respected real estate brokerage with a reputation for exceptional marketing and extraordinary culture of cooperation and inclusion.Who you are:You must be a well-organized, creative, proactive, positive, and most importantly, kind-hearted person. Please, be responsible, respectful, and cool-under-pressure. Please, be proficient in Adobe Creative Cloud (Indesign, Illustrator, Photoshop) and Microsoft Office Suite. Above all, have fantastic taste and be a good-hearted, fun-loving person who loves working with people and is eager to learn.Role:Our office is a fast-paced environment. You’ll work directly with a Marketing team and communicate daily with other core staff and our large team of agents. This description is a brief overview, but your skills and interests will be considered in what you work on and as the role evolves over time.Agent Assistance- Receive & Organize Marketing Requests from Agents- Track Tasks & Communicate with Marketing team & Agents on Status- Prepare print materials and signs for open houses- Submit Orders to Printers & Communicate & Track DeadlinesGraphic Design & Branding- Managing brand strategy and messaging through website, social media, videos, online advertising, print placement and events- Receive, organize, and prioritize marketing requests from agents- Fulfill agent design requests including postcards, signs, email marketing and property brochures using pre-existing templates and creating custom designs- Maintain brand assets and generic filesEvents & Community- Plan and execute events and promotions- Manage Contacts & Vendors for Event Planning & SponsorshipsOur company is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.Job Type: Full-time\nPay: $18-20/hour\nExpected hours: 35 – 45 per week\nBenefits:Paid time offSchedule:8 hour shiftMonday to FridayExperience:Marketing: 1 year (Preferred)Graphic design: 2 years (Preferred)Work Location: In person\n",
  "max_salary": 20.0,
  "location": "Princeton, NJ",
  "company_id": 2774458.0,
  "views": 20.0,
  "med_salary": null,
  "min_salary": 17.0,
  "formatted_work_type": "Full-time",
  "applies": 2.0,
  "original_listed_time": 1713397508000.0,
  "formatted_experience_level": "Not Specified",
  "skills_desc": "Requirements: \n\nWe are seeking a College or Graduate Student (can also be completed with school) with a focus in Planning, Architecture, Real Estate Development or Management or General Business. Must be able to work in an extremely fast paced environment and able to multitask and prioritize.",
  "listed_time": 1713397508000.0,
  "work_type": "FULL_TIME",
  "normalized_salary": 38480.0,
  "type": "Not Specified",
  "industry_name": "Real Estate",
  "skill_name": "Marketing",
  "name": "Corcoran Sawyer Smith",
  "description_y": "With years of experience helping local buyers and sellers just like yourself, we know how to locate the finest properties and negotiate the best deals. It's our\njob to know about the latest market conditions, government regulations, and upcoming developments — so that you don't have to.",
  "company_size": 2.0,
  "country": "US",
  "city": "Jersey City",
  "employee_count": 402.0,
  "follower_count": 2351.0
}
